OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
/*
 * Copyright (c) 2024 Arm Limited. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * -----------------------------------------------------------------------------
 *
 * $Date:       4. July 2024
 * $Revision:   V1.0
 *
 * Project:     USB Host EHCI Controller Driver
 *              for customized EHCI with internal Transaction Translator (TT)
 *              (with full/low speed support)
 *
 * -----------------------------------------------------------------------------
 */

/* History:
 *  Version 1.0
 *    Initial release
 */

#include "Driver_USBH_EHCI.h"

#include <stdio.h>
#include <string.h>

#include "Driver_USBH_EHCI_Config.h"
#include "Driver_USBH_EHCI_Regs.h"
#include "Driver_USBH_EHCI_HW.h"

//M55M1 series...
#include "NuMicro.h"
#include "misc.h"

// Driver Version *************************************************************
static const ARM_DRIVER_VERSION usbh_driver_version = { ARM_USBH_API_VERSION, ARM_DRIVER_VERSION_MAJOR_MINOR(1, 0) };
// ****************************************************************************

// Compile-time configuration *************************************************

// Configuration depending on the USBH_EHCI_Config.h

#if    (USBH1_EHCI_ENABLED == 1)
    #define USBH_EHCI_TT_INSTANCES         (2U)
    #error "M55M1 hasn't EHCI Port 1."
#else
    #define USBH_EHCI_TT_INSTANCES         (1U)
#endif

// ****************************************************************************

// Driver Capabilities ********************************************************
static ARM_USBH_CAPABILITIES usbh_driver_capabilities[USBH_EHCI_TT_INSTANCES] =
{
    {
        0x3FFFU,    /* Root HUB available Ports Mask   */
        0U,         /* Automatic SPLIT packet handling */
        1U,         /* Signal Connect event            */
        1U,         /* Signal Disconnect event         */
        1U,         /* Signal Overcurrent event        */
        0U          /* reserved bits                   */
    }
#if (USBH_EHCI_TT_INSTANCES >= 2)
    , {
        0x3FFFU,    /* Root HUB available Ports Mask   */
        0U,         /* Automatic SPLIT packet handling */
        1U,         /* Signal Connect event            */
        1U,         /* Signal Disconnect event         */
        1U,         /* Signal Overcurrent event        */
        0U          /* reserved bits                   */
    }
#endif
};
// ****************************************************************************

// Macros

#define USBHn_EHCI_COM_AREA_SECTION_(x) __attribute__((section(x)))

#if    (USBH0_EHCI_COM_AREA_LOCATE == 1)
    #define USBH0_EHCI_COM_AREA_SECTION(x)  USBHn_EHCI_COM_AREA_SECTION_(x)
#else
    #define USBH0_EHCI_COM_AREA_SECTION(x)
    #error "The qh/qtd/itd/sitd area needs to be placed in the Non-Cacheable region,please.(.bss.NonCacheable.ZeroInit)"
#endif

#if    (USBH1_EHCI_ENABLED == 1)
    #if    (USBH1_EHCI_COM_AREA_LOCATE == 1)
        #define USBH1_EHCI_COM_AREA_SECTION(x)  USBHn_EHCI_COM_AREA_SECTION_(x)
    #else
        #define USBH1_EHCI_COM_AREA_SECTION(x)
        #error "The qh/qtd/itd/sitd area needs to be placed in the Non-Cacheable region,please.(.bss.NonCacheable.ZeroInit)"
    #endif
#endif

#ifndef USBH_EHCI_MEM_PFL_SIZE
    #define USBH_EHCI_MEM_PFL_SIZE          (4096U)
#endif
#ifndef USBH_EHCI_MEM_QH_SIZE
    #define USBH_EHCI_MEM_QH_SIZE           (USBH_EHCI_MAX_PIPES * 512U)
#endif
#ifndef USBH_EHCI_MEM_QTD_SIZE
    #define USBH_EHCI_MEM_QTD_SIZE          (USBH_EHCI_MAX_PIPES * 512U)
#endif
#ifndef USBH_EHCI_MEM_SITD_SIZE
    #define USBH_EHCI_MEM_SITD_SIZE         (2U * (USBH_EHCI_MAX_PIPES - 1) * 32U)
#endif

// Transfer information structure
typedef struct
{
    uint32_t             *ptr_transfer;                       // pointer to transfer structure
    uint32_t             *ptr_pipe;                           // pointer to pipe structure
    uint32_t              packet;                             // packet
    uint8_t              *data;                               // pointer to data
    uint32_t              num;                                // number of bytes to transfer
    uint32_t              num_transferred_total;              // total number of bytes transferred
    uint32_t              num_to_transfer;                    // number of bytes to transfer in single transfer
    uint32_t              active;                             // activity flag
    uint32_t             *iso_ptr_pipe1;                      // iso pointer to additional pipe structure
    uint8_t              *iso_data1;                          // iso pointer to data for second transfer
    uint16_t              iso_max_transfer_size;              // iso maximum transfer size per frame
    uint16_t              iso_interval;                       // iso endpoint interval in (u)SOFs
    uint32_t              iso_last_frame_index;               // iso last transfer frame index
    uint32_t              iso_frame_index[2];                 // iso transfer frame index
} USBH_TransferInfo_t;

// Pipe event structure
typedef struct                                              // Additional Pipe Event parameters
{
    const uint8_t        *buf;                                // Data buffer start address
    uint32_t        len;                                // Number of transferred data bytes
} USBH_PipeEventInfo_t;

// Structure containing configuration values for EHCI Compliant Controller
typedef struct
{
    uint32_t              ctrl;                               // controller index (used for hardware specific driver)
    uint32_t             *ptr_EHCI;                           // pointer to memory mapped reg base address
    uint16_t              max_qH;                             // maximum queue Heads
    uint16_t              max_qTD;                            // maximum queue Transfer Descriptors
    uint16_t              max_iTD;                            // maximum Isochronous Transfer Descriptors
    uint16_t              max_siTD;                           // maximum split Isochronous Transfer Descriptors
    uint16_t              max_FSTN;                           // maximum periodic Frame Span Traversal Nodes
    uint16_t              pad0;                               // explicit padding
    uint32_t             *ptr_PFL;                            // pointer to Periodic Frame List memory
    uint32_t             *ptr_qH;                             // pointer to qH memory start
    uint32_t             *ptr_qTD;                            // pointer to qTD memory start
    uint32_t             *ptr_iTD;                            // pointer to iTD memory start
    uint32_t             *ptr_siTD;                           // pointer to siTD memory start
    uint32_t             *ptr_FSTN;                           // pointer to FSTN memory start
    USBH_TransferInfo_t  *ptr_TI;                             // pointer to Transfer Info (TI) array start
    USBH_PipeEventInfo_t *ptr_PEI;                            // pointer to Pipe Event Info (PEI)
    USBH_EHCI_Interrupt_t irq_handler;                        // pointer to EHCI Interrupt Handler Routine
} USBH_EHCI_t;

