OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
// Communication structure
typedef struct
{
    uint32_t              pfl  [USBH_EHCI_MEM_PFL_SIZE  / 4];
    uint32_t              qh   [USBH_EHCI_MEM_QH_SIZE   / 4];
    uint32_t              qtd  [USBH_EHCI_MEM_QTD_SIZE  / 4];
    uint32_t              sitd [USBH_EHCI_MEM_SITD_SIZE / 4];
} USBH_EHCI_ComArea_t;

// Local functions prototypes
static void Driver_USBH0_IRQ_Handler(void);
#if   (USBH1_EHCI_ENABLED == 1)
    static void Driver_USBH1_IRQ_Handler(void);
#endif

// USB Host 0 information
static USBH_TransferInfo_t  usbh0_transfer_info    [USBH_EHCI_MAX_PIPES];
static USBH_PipeEventInfo_t usbh0_pipe_evt_info;
static USBH_EHCI_ComArea_t  usbh0_ehci_com_area     USBH0_EHCI_COM_AREA_SECTION(USBH0_EHCI_COM_AREA_SECTION_NAME) __ALIGNED(USBH_EHCI_MEM_PFL_SIZE);
static const USBH_EHCI_t    usbh0_ehci = {          USBH0_EHCI_DRV_NUM,
                                                    (uint32_t *)USBH0_EHCI_BASE_ADDR,
                                                    USBH_EHCI_MAX_PIPES,
                                                    USBH_EHCI_MAX_PIPES,
                                                    0U,
                                                    2 * (USBH_EHCI_MAX_PIPES - 1),
                                                    1024U,
                                                    0U, // padding byte
                                                    &usbh0_ehci_com_area.pfl[0],
                                                    &usbh0_ehci_com_area.qh[0],
                                                    &usbh0_ehci_com_area.qtd[0],
                                                    NULL,
                                                    &usbh0_ehci_com_area.sitd[0],
                                                    NULL,
                                                    &usbh0_transfer_info[0],
                                                    &usbh0_pipe_evt_info,
                                                    Driver_USBH0_IRQ_Handler
                                         };

// USB Host 1 information
#if   (USBH1_EHCI_ENABLED == 1)
static USBH_TransferInfo_t  usbh1_transfer_info    [USBH_EHCI_MAX_PIPES];
static USBH_PipeEventInfo_t usbh1_pipe_evt_info;
static USBH_EHCI_ComArea_t  usbh1_ehci_com_area     USBH1_EHCI_COM_AREA_SECTION(USBH1_EHCI_COM_AREA_SECTION_NAME) __ALIGNED(USBH_EHCI_MEM_PFL_SIZE);
static const USBH_EHCI_t    usbh1_ehci = {          USBH1_EHCI_DRV_NUM,
                                                    (uint32_t *)USBH1_EHCI_BASE_ADDR,
                                                    USBH_EHCI_MAX_PIPES,
                                                    USBH_EHCI_MAX_PIPES,
                                                    0U,
                                                    2 * (USBH_EHCI_MAX_PIPES - 1),
                                                    1024U,
                                                    0U, // padding byte
                                                    &usbh1_ehci_com_area.pfl[0],
                                                    &usbh1_ehci_com_area.qh[0],
                                                    &usbh1_ehci_com_area.qtd[0],
                                                    NULL,
                                                    &usbh1_ehci_com_area.sitd[0],
                                                    NULL,
                                                    &usbh1_transfer_info[0],
                                                    &usbh1_pipe_evt_info,
                                                    Driver_USBH1_IRQ_Handler
                                         };
#endif // (USBH1_EHCI_ENABLED == 1)

// USB Hosts information
static const USBH_EHCI_t *const usbh_ehci_ptr[USBH_EHCI_TT_INSTANCES] =
{
    &usbh0_ehci
#if   (USBH_EHCI_TT_INSTANCES >= 2)
    , &usbh1_ehci
#endif
};

static HSUSBH_T                    *usbh_ehci_reg_ptr[USBH_EHCI_TT_INSTANCES];
static ARM_USBH_SignalPortEvent_t  signal_port_event[USBH_EHCI_TT_INSTANCES];
static ARM_USBH_SignalPipeEvent_t  signal_pipe_event[USBH_EHCI_TT_INSTANCES];

static uint32_t pfl_size[USBH_EHCI_TT_INSTANCES];
static uint32_t port_act[USBH_EHCI_TT_INSTANCES];

/* USBH Transfer and Endpoint Helper Functions ------------*/

/**
  \fn          uint16_t USBH_EHCI_PFL_GetSize (uint8_t ctrl)
  \brief       Get size (number of entries) of Periodic Frame List
  \param[in]   ctrl        Index of USB Host controller
  \return      size of Periodic Frame List (256, 512 or 1024)
*/
static uint16_t USBH_EHCI_PFL_GetSize(uint8_t ctrl)
{
    uint32_t  usbcmd;
    uint32_t  i;
    uint16_t  sz;

    usbcmd = usbh_ehci_reg_ptr[ctrl]->UCMDR;
    sz  =   1024;
    i   = (usbcmd >> 2) & 0x03U;

    while ((i--) != 0U)
    {
        sz >>= 1;
    }

    return sz;
}

/**
  \fn          void USBH_EHCI_PFL_Clear (uint8_t ctrl)
  \brief       Clear Periodic Frame List
  \param[in]   ctrl        Index of USB Host controller
*/
static void USBH_EHCI_PFL_Clear(uint8_t ctrl)
{
    uint32_t *ptr_uint32_t;
    uint32_t  sz;

    sz = USBH_EHCI_PFL_GetSize(ctrl);
    ptr_uint32_t = (usbh_ehci_ptr[ctrl])->ptr_PFL;

    while ((sz--) != 0U)
    {
        *ptr_uint32_t = 1U;                 // Set T bit to 1, thus disable entry
        ptr_uint32_t++;
    }
}

/**
  \fn          void USBH_EHCI_IOC (uint32_t *ptr_pfl_entry)
  \brief       Process periodic transfers chain and disable IoC (Interrupt On Complete) on all but last periodic transfer
  \param[in]   ptr_pfl_entry    Pointer to Periodic Frame List entry to start from
  \return      none
*/
static void USBH_EHCI_IOC(uint32_t *ptr_pfl_entry)
{
    USBH_EHCI_COMMON *ptr_curr;
    USBH_EHCI_COMMON *ptr_int_td;

    if (ptr_pfl_entry == NULL)
    {
        return;
    }

    if ((*ptr_pfl_entry & 1U) != 0U)
    {
        return;    // If terminate bit is 1 (not a valid entry)
    }

    // If terminate bit is 0 (valid entry)
    ptr_curr = (USBH_EHCI_COMMON *)(*ptr_pfl_entry & (~0x1FU));

    // Process all isochronous (siTDs) first
    while ((ptr_curr->DW0.LinkPtr != 0U) &&
            (ptr_curr->DW0.Typ == USBH_EHCI_ELEMENT_TYPE_siTD) &&
            (ptr_curr->DW0.T == 0U))
    {
        ((USBH_EHCI_siTD *)ptr_curr)->DW3.IOC = 0U;         // Clear IOC (for current siTD)
        ptr_curr = (USBH_EHCI_COMMON *)(ptr_curr->DW0.LinkPtr << 5);
    }

