OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    if ((ptr_curr->DW0.LinkPtr != 0U) &&
            (ptr_curr->DW0.Typ == USBH_EHCI_ELEMENT_TYPE_qH) &&
            (ptr_curr->DW0.T == 0U))
    {
        // Process all interrupt (qH)
        do
        {
            ptr_int_td = ptr_curr;

            while ((ptr_int_td->DW0.LinkPtr != 0U) &&
                    (ptr_int_td->DW0.T == 0U))
            {
                ((USBH_EHCI_qTD *)ptr_int_td)->DW2.IOC = 0U;      // Clear IOC (for current qTD)
                ptr_int_td = (USBH_EHCI_COMMON *)(ptr_int_td->DW0.LinkPtr << 5);
            }
        } while ((ptr_curr->DW0.LinkPtr != 0U) &&
                 (ptr_curr->DW0.Typ == USBH_EHCI_ELEMENT_TYPE_qH) &&
                 (ptr_curr->DW0.T == 0U));

        ((USBH_EHCI_siTD *)ptr_int_td)->DW3.IOC = 1U;         // Set IOC (for last qTD)
    }
    else
    {
        // There are no interrupt qH in chain, so ptr_curr points to last siTD
        ((USBH_EHCI_siTD *)ptr_curr)->DW3.IOC = 1U;           // Set IOC (for last siTD)
    }
}

/**
  \fn          bool USBH_EHCI_StartStop (uint8_t ctrl, uint8_t type, bool start)
  \brief       Start or stop asynchronous or periodic schedule processing
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   type        Type of processing to start
                             USBH_EHCI_ASYNC_SCHED:     asynchronous schedule
                             USBH_EHCI_PERIODIC_SCHED:  periodic schedule
  \param[in]   start       Start or stop
                             true:                      start schedule processing
                             false:                     stop schedule processing
  \return      true = success, false = fail
*/
static bool USBH_EHCI_StartStop(uint8_t ctrl, uint8_t type, bool start)
{
    uint32_t usbcmd, usbsts;
    uint32_t tout;
    uint32_t msk;

    if (type == USBH_EHCI_ASYNC_SCHED)              // Asynchronous type
    {
        msk = (1UL << 5);
    }
    else                                            // Periodic type
    {
        msk = (1UL << 4);
    }

    // Wait for status = command (max 1 second)
    for (tout = 10100U; ; tout--)
    {
        usbcmd = usbh_ehci_reg_ptr[ctrl]->UCMDR;
        usbsts = usbh_ehci_reg_ptr[ctrl]->USTSR;

        if (((usbcmd ^ (usbsts >> 10)) & msk) == 0U)
        {
            break;
        }

        if (tout ==   0U)
        {
            return false;
        }

        if (tout <= 100U)
        {
            (void)delay_ms(10U);
        }
    }

    if (start)
    {
        if ((usbh_ehci_reg_ptr[ctrl]->UCMDR & msk) == 0U)          // If schedule disabled
        {
            usbh_ehci_reg_ptr[ctrl]->UCMDR |=  msk;                  // enable schedule
        }
    }
    else
    {
        if ((usbh_ehci_reg_ptr[ctrl]->UCMDR & msk) != 0U)          // If schedule enabled
        {
            usbh_ehci_reg_ptr[ctrl]->UCMDR &= ~msk;                  // disable schedule
        }
    }

    // Wait for status = command (max 1 second)
    for (tout = 10100U; ; tout--)
    {
        usbcmd = usbh_ehci_reg_ptr[ctrl]->UCMDR;
        usbsts = usbh_ehci_reg_ptr[ctrl]->USTSR;

        if (((usbcmd ^ (usbsts >> 10)) & msk) == 0U)
        {
            break;
        }

        if (tout ==   0U)
        {
            return false;
        }

        if (tout <= 100U)
        {
            (void)delay_ms(10U);
        }
    }

    return true;
}

/**
  \fn          bool USBH_EHCI_DoHandshake (uint8_t ctrl)
  \brief       Do handshake for asynchronous schedule
  \param[in]   ctrl        Index of USB Host controller
  \return      true = success, false = fail
*/
#if 0
static bool USBH_EHCI_DoHandshake(uint8_t ctrl)
{
    uint32_t tout;

    // Activate Interrupt on Async Advance Doorbell
    usbh_ehci_reg_ptr[ctrl]->USBCMD &= ~(1 << 6);

    tout = 10100;

    while (!((usbh_ehci_reg_ptr[ctrl]->USBSTS >> 5) & 1))
    {
        if (tout-- <= 100)
        {
            if (tout == 0) return false;

            (void)delay_ms(10U);
        }
    }

    usbh_ehci_reg_ptr[ctrl]->USBSTS = (1 << 5);     // Clear Interrupt on Async Advance

    return true;
}
#endif

/**
  \fn          USBH_EHCI_qTD *USBH_EHCI_qTD_GetFree (uint8_t ctrl)
  \brief       Get free queue element Transfer Descriptor
  \param[in]   ctrl        Index of USB Host controller
  \return                  Pointer to first free queue element Transfer Descriptor, no free or function failed
               value > 0:  pointer to first free queue element Transfer Descriptor
               value = 0:  no free queue element Transfer Descriptor exists or function failed
*/
static USBH_EHCI_qTD *USBH_EHCI_qTD_GetFree(uint8_t ctrl)
{
    USBH_EHCI_qTD *ptr_qTD;
    uint32_t       i;

    ptr_qTD = (USBH_EHCI_qTD *)((uint32_t)((usbh_ehci_ptr[ctrl])->ptr_qTD));

    if (ptr_qTD == NULL)
    {
        return NULL;
    }

    for (i = 0; i < (usbh_ehci_ptr[ctrl])->max_qTD; i++)
    {
        if (ptr_qTD->DW2.IOC == 0U)
        {
            return ptr_qTD;
        }

        ptr_qTD++;
    }

    return NULL;
}

/**
  \fn          USBH_EHCI_qTD *USBH_EHCI_qTD_GetNext_qTD (const USBH_EHCI_qTD *ptr_qTD)
  \brief       Get next queue element Transfer Descriptor from requested queue element Transfer Descriptor
  \param[in]   ptr_qTD     Pointer to queue element Transfer Descriptor
  \return                  Pointer to next queue element Transfer Descriptor, no next or function failed
               value > 0:  pointer to next queue element Transfer Descriptor
               value = 0:  no next queue element Transfer Descriptor exists or function failed
*/
static USBH_EHCI_qTD *USBH_EHCI_qTD_GetNext_qTD(const USBH_EHCI_qTD *ptr_qTD)
{
    uint32_t addr;

    if (ptr_qTD == NULL)
    {
        return NULL;
    }

    if (!(ptr_qTD->DW0.T))                // If terminate is 0
    {
        addr = (uint32_t)ptr_qTD->DW0.NextPtr << 5;
        return (USBH_EHCI_qTD *)addr;
    }

    return NULL;
}

/**
  \fn          USBH_EHCI_qTD *USBH_EHCI_qTD_GetPrevious (uint8_t ctrl, const USBH_EHCI_qTD *ptr_qTD)
  \brief       Get previous linked queue element Transfer Descriptor linked to this one (before it)
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qTD     Pointer to queue element Transfer Descriptor
  \return                  Pointer to previous linked queue element Transfer Descriptor, no previous or function failed
               value > 0:  pointer to previous linked queue element Transfer Descriptor
               value = 0:  no previous linked queue element Transfer Descriptor exists or function failed
*/
static USBH_EHCI_qTD *USBH_EHCI_qTD_GetPrevious(uint8_t ctrl, const USBH_EHCI_qTD *ptr_qTD)
{
    USBH_EHCI_qTD *ptr_prev_qTD;
    uint32_t       i;

