OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    if (ptr_qTD == NULL)
    {
        return NULL;
    }

    ptr_prev_qTD = (USBH_EHCI_qTD *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_qTD);

    if (ptr_prev_qTD == NULL)
    {
        return NULL;
    }

    for (i = 0U; i < (usbh_ehci_ptr[ctrl])->max_qTD; i++)
    {
        if (ptr_qTD == USBH_EHCI_qTD_GetNext_qTD(ptr_prev_qTD))
        {
            return ptr_prev_qTD;
        }

        ptr_prev_qTD++;
    }

    return NULL;
}

/**
  \fn          USBH_EHCI_qTD *USBH_EHCI_qTD_GetNext_qH (const USBH_EHCI_qH *ptr_qH)
  \brief       Get next queue element Transfer Descriptor for queue Head
  \param[in]   ptr_qH      Pointer to queue Head
  \return                  Pointer to next queue element Transfer Descriptor for queue Head, no next or function failed
               value > 0:  pointer to next queue element Transfer Descriptor for queue Head
               value = 0:  no next queue element Transfer Descriptor exists for queue Head or function failed
*/
static USBH_EHCI_qTD *USBH_EHCI_qTD_GetNext_qH(const USBH_EHCI_qH *ptr_qH)
{
    uint32_t addr;

    if (ptr_qH == NULL)
    {
        return NULL;
    }

    if (ptr_qH->DW4.T == 0U)              // If terminate is 0
    {
        addr = (uint32_t)ptr_qH->DW4.NextPtr << 5;
        return (USBH_EHCI_qTD *)addr;
    }

    return NULL;
}

/**
  \fn          bool USBH_EHCI_qTD_IsLinkedIn_qH (const USBH_EHCI_qH *ptr_qH, const USBH_EHCI_qTD *ptr_qTD)
  \brief       Check if Transfer Descriptor is already linked in queue Head
  \param[in]   ptr_qH      Pointer to queue Head
  \param[in]   ptr_qTD     Pointer to queue element Transfer Descriptor
  \return      true = already linked, false = not linked

*/
static bool USBH_EHCI_qTD_IsLinkedIn_qH(const USBH_EHCI_qH *ptr_qH, const USBH_EHCI_qTD *ptr_qTD)
{
    USBH_EHCI_qTD *ptr_curr_qTD;

    if (ptr_qH  == NULL)
    {
        return NULL;
    }

    if (ptr_qTD == NULL)
    {
        return NULL;
    }

    if ((ptr_qH->DW4.T == 0U) && ((ptr_qH->DW4.NextPtr << 5) != 0U))
    {
        ptr_curr_qTD = (USBH_EHCI_qTD *)(ptr_qH->DW4.NextPtr << 5);

        while ((ptr_curr_qTD->DW0.T == 0U) && ((ptr_curr_qTD->DW0.NextPtr << 5) != 0U))
        {
            if ((((uint32_t)ptr_curr_qTD->DW0.NextPtr) << 5) == (uint32_t)ptr_qTD)
            {
                return true;
            }

            ptr_curr_qTD = (USBH_EHCI_qTD *)(ptr_qH->DW4.NextPtr << 5);
        }
    }

    return false;
}

/**
  \fn          USBH_EHCI_qTD *USBH_EHCI_qTD_GetLast (const USBH_EHCI_qH *ptr_qH)
  \brief       Get last queue element Transfer Descriptor for queue Head
  \param[in]   ptr_qH      Pointer to queue Head
  \return                  Pointer to last queue element Transfer Descriptor, no last or function failed
               value > 0:  pointer to last queue element Transfer Descriptor
               value = 0:  no last queue element Transfer Descriptor exists or function failed
*/
static USBH_EHCI_qTD *USBH_EHCI_qTD_GetLast(const USBH_EHCI_qH *ptr_qH)
{
    USBH_EHCI_qTD *ptr_qTD;
    USBH_EHCI_qTD *ptr_next_qTD;

    if (ptr_qH == NULL)
    {
        return NULL;
    }

    ptr_qTD = USBH_EHCI_qTD_GetNext_qH(ptr_qH);

    if (ptr_qTD == NULL)
    {
        return NULL;
    }

    do
    {
        ptr_next_qTD = USBH_EHCI_qTD_GetNext_qTD(ptr_qTD);
        ptr_qTD = ptr_next_qTD;
    } while (ptr_next_qTD != NULL);

    return ptr_qTD;
}

/**
  \fn          USBH_EHCI_qTD *USBH_EHCI_qTD_Clear (USBH_EHCI_qTD *ptr_qTD)
  \brief       Clear queue element Transfer Descriptor and return pointer to next linked queue element Transfer Descriptor
  \param[in]   ptr_qTD     Pointer to queue element Transfer Descriptor to be cleared
  \return                  Pointer to next linked queue element Transfer Descriptor, no next or function failed
               value > 0:  pointer to next linked queue element Transfer Descriptor
               value = 0:  no next linked queue element Transfer Descriptor exists or function failed
*/
static USBH_EHCI_qTD *USBH_EHCI_qTD_Clear(USBH_EHCI_qTD *ptr_qTD)
{
    USBH_EHCI_qTD *ptr_next_qTD;

    if (ptr_qTD == NULL)
    {
        return NULL;
    }

    ptr_next_qTD = USBH_EHCI_qTD_GetNext_qTD(ptr_qTD);
    memset(ptr_qTD, 0, sizeof(USBH_EHCI_qTD));
    ptr_qTD->DW0.T = 1U;                  // Set Next qTD pointer T bit to 1
    ptr_qTD->DW1.T = 1U;                  // Set Alternate Next qTD pointer T bit to 1

    return ptr_next_qTD;
}

/**
  \fn          void USBH_EHCI_qTD_ClearAll (uint8_t ctrl)
  \brief       Clear all queue element Transfer Descriptors
  \param[in]   ctrl        Index of USB Host controller
*/
static void USBH_EHCI_qTD_ClearAll(uint8_t ctrl)
{
    USBH_EHCI_qTD *ptr_qTD;
    uint32_t       i;

    ptr_qTD = (USBH_EHCI_qTD *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_qTD);

    if (ptr_qTD != NULL)
    {
        for (i = 0U; i < (usbh_ehci_ptr[ctrl])->max_qTD; i++)
        {
            (void)USBH_EHCI_qTD_Clear(ptr_qTD);
            ptr_qTD++;
        }
    }
}

/**
  \fn          bool USBH_EHCI_qTD_Enqueue (uint8_t              ctrl,
                                           USBH_TransferInfo_t *ptr_TI,
                                           USBH_EHCI_qH        *ptr_qH,
                                           USBH_EHCI_qTD       *ptr_qTD,
                                           uint32_t             packet,
                                           uint8_t             *data,
                                           uint32_t             num)
  \brief       Enqueue Control/Bulk/Interrupt Transfer
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_TI      Pointer to Transfer Info
  \param[in]   ptr_qH      Pointer to queue Head
  \param[in]   ptr_qTD     Pointer to queue element Transfer Descriptor to enqueue
  \param[in]   packet      Packet information
  \param[in]   data        Pointer to buffer with data to send or for data to receive
  \param[in]   num         Number of data bytes to transfer
  \return      true = success, false = fail
*/
static bool USBH_EHCI_qTD_Enqueue(uint8_t ctrl, USBH_TransferInfo_t *ptr_TI, USBH_EHCI_qH *ptr_qH, USBH_EHCI_qTD *ptr_qTD, uint32_t packet, uint8_t *data, uint32_t num)
{
    USBH_EHCI_qTD *ptr_last_qTD;
    uint32_t       sz;

    (void)ctrl;

    if (ptr_qH  == NULL)
    {
        return false;
    }

