OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    if (ptr_qTD == NULL)
    {
        return false;
    }

    // Fill queue Element Transfer Descriptor fields
    switch (packet & ARM_USBH_PACKET_TOKEN_Msk)
    {
        case ARM_USBH_PACKET_IN:
            ptr_qTD->DW2.PID = 1U;            // PID Code = IN Token
            break;

        case ARM_USBH_PACKET_OUT:
            ptr_qTD->DW2.PID = 0U;            // PID Code = OUT Token
            break;

        case ARM_USBH_PACKET_SETUP:
            ptr_qTD->DW2.PID = 2U;            // PID Code = SETUP Token
            ptr_qH->DW6.DT   = 0U;            // Force Data Toggle for SETUP packet to DATA0
            break;

        case ARM_USBH_PACKET_PING:
            ptr_qTD->DW2.Status |= 1U;        // Do PING
            break;

        default:
            return false;
    }

    switch (packet & ARM_USBH_PACKET_DATA_Msk)
    {
        case ARM_USBH_PACKET_DATA0:
            ptr_qH->DW6.DT = 0U;
            break;

        case ARM_USBH_PACKET_DATA1:
            ptr_qH->DW6.DT = 1U;
            break;

        default:                            // Keep previous data toggle
            break;
    }

    ptr_qTD->DW2.TBT    = (uint16_t)num;  // Total Bytes to Transfer
    ptr_qTD->DW2.IOC    = 1U;             // Interrupt On Complete
    ptr_qTD->DW2.C_Page = 0U;             // Current Page
    ptr_qTD->DW2.CERR   = 3U;             // Error Counter
    ptr_qTD->DW0.T      = 1U;
    ptr_qTD->DW1.T      = 1U;

    if (num == 0U)                        // For 0 size packet
    {
        ptr_qTD->DW3.CurOfs = 0U;
        ptr_qTD->DW3.BufPtr = 0U;
    }
    else if (num <= 16536U)
    {
        ptr_qTD->DW3.CurOfs = (uint16_t)((uint32_t)data & 0xFFFU);
        ptr_qTD->DW3.BufPtr = (uint32_t)data >> 12;
        sz = (((uint32_t)(data) & 0xFFFU) + num);

        if (sz > (1U * 4096U))
        {
            ptr_qTD->DW4.BufPtr = ptr_qTD->DW3.BufPtr + 1U;

            if (sz > (2U * 4096U))
            {
                ptr_qTD->DW5.BufPtr = ptr_qTD->DW3.BufPtr + 2U;

                if (sz > (3U * 4096U))
                {
                    ptr_qTD->DW6.BufPtr = ptr_qTD->DW3.BufPtr + 3U;

                    if (sz > (4U * 4096U))
                    {
                        ptr_qTD->DW7.BufPtr = ptr_qTD->DW3.BufPtr + 4U;
                    }
                }
            }
        }
    }
    else
    {
        return false;
    }

    if ((ptr_qH->DW6.Status & 0x40U) != 0U)       // If qH status is Halted
    {
        ptr_qH->DW6.Status = 0U;            // Clear Halted status
    }

    ptr_qTD->DW2.Status = 0x80U;          // Status Active bit set to 1
    ptr_TI->active = 1U;                  // Set active bit in Transfer Info

    // Check if qTD is already linked in qH, if it is not we need to link it in
    if (USBH_EHCI_qTD_IsLinkedIn_qH(ptr_qH, ptr_qTD) == false)
    {
        ptr_last_qTD = USBH_EHCI_qTD_GetLast(ptr_qH);

        if (ptr_last_qTD != NULL)           // If there are qTDs linked to qH
        {
            // Set Next qTD pointer
            ptr_last_qTD->DW0.NextPtr = (uint32_t)(ptr_qTD) >> 5;
            ptr_last_qTD->DW0.T       = 0U;   // T-bit = 0 => activate transfer described by TD
        }
        else
        {
            // Set Next qTD pointer
            ptr_qH->DW4.NextPtr       = (uint32_t)(ptr_qTD) >> 5;
            ptr_qH->DW4.T             = 0U;   // T-bit = 0 => activate transfer described by TD
        }
    }

    return true;
}

/**
  \fn          bool USBH_EHCI_IsoTransferActivate (uint8_t              ctrl,
                                                   USBH_TransferInfo_t *ptr_TI,
                                                   void                *ptr_pe,
                                                   uint32_t             packet,
                                                   uint8_t             *data,
                                                   uint32_t             num)
  \brief       Activate Isochronous Transfer
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_TI      Pointer to Transfer Info
  \param[in]   ptr_pe      Pointer to Periodic Element (iTD/siTD)
  \param[in]   data        Pointer to buffer with data to send or for data to receive
  \param[in]   num         Number of data bytes to transfer
  \return      true = success, false = fail
*/
static bool USBH_EHCI_IsoTransferActivate(uint8_t ctrl, USBH_TransferInfo_t *ptr_TI, void *ptr_pe, uint8_t *data, uint32_t num)
{
    USBH_EHCI_siTD    *ptr_siTD;
    USBH_EHCI_siTD    *ptr_curr_siTD;
    uint32_t          *ptr_uint32_t;
    uint32_t           pfl_index, ti_index;

    if (ptr_TI == NULL)
    {
        return false;
    }

    if (ptr_pe == NULL)
    {
        return false;
    }

    switch (((USBH_EHCI_COMMON *)ptr_pe)->DW0.Typ)
    {
        case USBH_EHCI_ELEMENT_TYPE_iTD:
            // High-speed isochronous transfers not supported
            return false;

        case USBH_EHCI_ELEMENT_TYPE_qH:
            return false;

        case USBH_EHCI_ELEMENT_TYPE_siTD:

            ptr_siTD = (USBH_EHCI_siTD *)ptr_pe;

            if (ptr_TI->ptr_pipe == (uint32_t *)ptr_siTD)
            {
                ti_index = 0U;
            }
            else
            {
                ti_index = 1U;
            }

            // Load transfer related parameters into siTD structure
            ptr_siTD->DW0.T    = 1U;              // Link to next is invalid
            ptr_siTD->DW0.NextLinkPtr = 0U;       // Next Link Pointer is invalid (0)
            ptr_siTD->DW3.TBT  = (uint16_t)num;   // Total Bytes to Transfer
            ptr_siTD->DW3.IOC  = 0U;              // Clear Interrupt On Complete
            ((USBH_EHCI_siTD_DW *)ptr_siTD)->DW[4] = (uint32_t)data;  // Set DW4.BufPtr and DW4.CurOfs
            ptr_siTD->DW5.BufPtr = ptr_siTD->DW4.BufPtr + 1U;
            ptr_siTD->DW3.Status = 0x80U;         // Status Active bit set to 1

            // Beginning of the Periodic Frame List
            ptr_uint32_t = (uint32_t *)((usbh_ehci_ptr[ctrl])->ptr_PFL);

            if (ptr_TI->active == 0U)
            {
                // If this is first iso transfer, offset it by 5 frames from current frame
                pfl_index = ((usbh_ehci_reg_ptr[ctrl]->UFINDR) >> 3) + 5U;
            }
            else
            {
                // Otherwise increment from last frame number
                pfl_index = ptr_TI->iso_last_frame_index + ptr_TI->iso_interval;
            }

            // pfl_index is Periodic Frame List entry index for new transfer
            // ptr_uint32_t pints to Periodic Frame List entry for new transfer
            pfl_index &= (pfl_size[ctrl] - 1U);
            ptr_uint32_t += pfl_index;
            ptr_TI->iso_last_frame_index = pfl_index;
            ptr_TI->iso_frame_index[ti_index] = pfl_index;

