OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
            // Insert siTD into PFL, if entry already exists append this new transfer to
            // last existing isochronous transfer
            if (((*ptr_uint32_t & 0x1FU) == 4U) &&    // If T bit is 0 and Type is siTD, meaning it is valid entry
                    ((*ptr_uint32_t &(~0x1FU)) != 0U))    // and if NextLinkPointer is != 0
            {
                // Find last iso entry and add new one behind it
                ptr_curr_siTD = (USBH_EHCI_siTD *)(*ptr_uint32_t & ~0x1FU);

                while ((ptr_curr_siTD->DW0.NextLinkPtr != 0U) &&
                        (ptr_curr_siTD->DW0.Typ == USBH_EHCI_ELEMENT_TYPE_siTD) &&
                        (ptr_curr_siTD->DW0.T == 0U))
                {
                    ptr_curr_siTD = (USBH_EHCI_siTD *)(ptr_curr_siTD->DW0.NextLinkPtr << 5);
                }

                // Add new siTD after ptr_curr_siTD which is currently last siTD
                ptr_siTD->DW0.NextLinkPtr = ptr_curr_siTD->DW0.NextLinkPtr;
                ptr_siTD->DW0.T = ptr_curr_siTD->DW0.T;
                ptr_curr_siTD->DW0.NextLinkPtr = ((uint32_t)ptr_siTD) >> 5;
                ptr_curr_siTD->DW0.T = 0U;
            }
            else
            {
                // If this is first siTD entry in frame
                // Link existing PFL entry pointer to this siTD
                ptr_siTD->DW0.NextLinkPtr = *ptr_uint32_t >> 5;
                ptr_siTD->DW0.T = (*ptr_uint32_t & 1U);

                // Set PFL entry to point to this new siTD
                *ptr_uint32_t = (uint32_t)ptr_siTD | 4U;
            }

            // Enable only IoC on last periodic transfer, remove on all previous
            USBH_EHCI_IOC(ptr_uint32_t);

            ptr_TI->active = 1U;                  // Set active status in Transfer Info
            break;

        case USBH_EHCI_ELEMENT_TYPE_FSTN:
            return false;
    }

    return true;
}

/**
  \fn          bool USBH_EHCI_qTD_Dequeue (uint8_t        ctrl,
                                           USBH_EHCI_qH  *ptr_qH,
                                           USBH_EHCI_qTD *ptr_qTD)
  \brief       Dequeue Control/Bulk/Interrupt Transfer
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qH      Pointer to queue Head
  \param[in]   ptr_qTD     Pointer to queue element Transfer Descriptor to dequeue
  \return      true = success, false = fail
*/
static bool USBH_EHCI_qTD_Dequeue(uint8_t ctrl, USBH_EHCI_qH *ptr_qH, USBH_EHCI_qTD *ptr_qTD)
{
    USBH_EHCI_qTD *ptr_prev_qTD;
    USBH_EHCI_qTD *ptr_next_qTD;
    uint8_t        was_active;

    if (ptr_qH  == NULL)
    {
        return false;
    }

    if (ptr_qTD == NULL)
    {
        return false;
    }

    was_active = 0U;

    if ((ptr_qH->DW6.Status & (1UL << 7)) != 0U)
    {
        was_active = 1U;

        if (ptr_qH->DW2.ISM != 0U)
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, false);
        }
        else
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED,    false);
        }

        ptr_qH->DW6.Status = 0U;

        while ((ptr_qH->DW6.Status & (1UL << 7)) != 0U)
        {
            __NOP();    // Wait for deactivate
        }
    }

    ptr_next_qTD = USBH_EHCI_qTD_Clear(ptr_qTD);
    ptr_prev_qTD = USBH_EHCI_qTD_GetPrevious(ctrl, ptr_qTD);

    if ((ptr_prev_qTD != NULL) && (ptr_next_qTD != NULL))         // If previous and next TD exists
    {
        ptr_prev_qTD->DW0.NextPtr = (uint32_t)ptr_next_qTD >> 5;
        ptr_prev_qTD->DW0.T = 0U;
        ptr_prev_qTD->DW1.T = 1U;
    }
    else if (ptr_prev_qTD != NULL)        // If only previous TD exists
    {
        ptr_prev_qTD->DW0.T = 1U;
        ptr_prev_qTD->DW1.T = 1U;
    }
    else if (ptr_next_qTD != NULL)        // If only next TD exists
    {
        ptr_qH->DW4.NextPtr = (uint32_t)(ptr_next_qTD) >> 5;
        ptr_qH->DW4.T       = 0U;           // T-bit = 0 => activate transfer described by TD
    }
    else
    {
        // both prev and next qTD are NULL, nothing to do
    }

    if (was_active == 1U)
    {
        if (ptr_qH->DW2.ISM != 0U)
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, true);
        }
        else
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED,    true);
        }
    }

    return true;
}

/**
  \fn          USBH_EHCI_qH *USBH_EHCI_qH_Clear (USBH_EHCI_qH *ptr_qH)
  \brief       Clear queue Head and return pointer to next linked queue Head
  \param[in]   ptr_qH      Pointer to queue Head
  \return                  Pointer to next linked queue Head, no next or function failed
               value > 0:  pointer to next linked queue Head
               value = 0:  no next linked queue Head exists or function failed
*/
static USBH_EHCI_qH *USBH_EHCI_qH_Clear(USBH_EHCI_qH *ptr_qH)
{
    USBH_EHCI_qH *ptr_next_qH;
    uint32_t      addr;

    if (ptr_qH == NULL)
    {
        return NULL;
    }

    if (ptr_qH->DW0.T == 0U)
    {
        addr = (uint32_t)ptr_qH->DW0.HorizLinkPtr << 5;
        ptr_next_qH = (USBH_EHCI_qH *)addr;
    }
    else
    {
        ptr_next_qH =  NULL;
    }

    memset(ptr_qH, 0, sizeof(USBH_EHCI_qH));
    ptr_qH->DW4.T = 1U;                   // Set Next qTD pointer T bit to 1
    ptr_qH->DW5.T = 1U;                   // Set Alternate Next qTD pointer T bit to 1

    return ptr_next_qH;
}

/**
  \fn          void *USBH_EHCI_PE_Clear (void *ptr_pe)
  \brief       Clear Periodic Element (qH/iTD/siTD) and return pointer to next linked Periodic Element
  \param[in]   ptr_PE      Pointer to qH/iTD/siTD
  \return                  Pointer to next linked qH/iTD/siTD, no next or function failed
               value > 0:  pointer to next linked qH/iTD/siTD
               value = 0:  no next linked qH/iTD/siTD exists or function failed
*/
static void *USBH_EHCI_PE_Clear(void *ptr_pe)
{
    USBH_EHCI_COMMON *ptr_curr;
    USBH_EHCI_COMMON *ptr_next;
    uint32_t          len = 0U;

    if (ptr_pe == NULL)
    {
        return NULL;
    }

    ptr_curr = (USBH_EHCI_COMMON *)ptr_pe;

    if (ptr_curr->DW0.T == 0U)
    {
        ptr_next = (USBH_EHCI_COMMON *)(*((uint32_t *)ptr_pe) & 0xFFFFFFE0U);
    }
    else
    {
        ptr_next = NULL;
    }

