OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    switch (ptr_curr->DW0.Typ)
    {
        case USBH_EHCI_ELEMENT_TYPE_iTD:
            len = sizeof(USBH_EHCI_iTD);
            break;

        case USBH_EHCI_ELEMENT_TYPE_qH:
            len = sizeof(USBH_EHCI_qH);
            break;

        case USBH_EHCI_ELEMENT_TYPE_siTD:
            len = sizeof(USBH_EHCI_siTD);
            break;

        case USBH_EHCI_ELEMENT_TYPE_FSTN:
            len = sizeof(USBH_EHCI_FSTN);
            break;
    }

    memset(ptr_curr, 0, len);

    return ptr_next;
}

/**
  \fn          void USBH_EHCI_qH_ClearAll (uint8_t ctrl)
  \brief       Clear all queue Heads
  \param[in]   ctrl        Index of USB Host controller
*/
static void USBH_EHCI_qH_ClearAll(uint8_t ctrl)
{
    USBH_EHCI_qH *ptr_qH;
    uint32_t      cnt;

    ptr_qH = (USBH_EHCI_qH *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_qH);

    if (ptr_qH == NULL)
    {
        return;
    }

    cnt = (usbh_ehci_ptr[ctrl])->max_qH;

    while (cnt != 0U)
    {
        cnt--;
        memset(ptr_qH, 0, sizeof(USBH_EHCI_qH));
        ptr_qH->DW4.T = 1U;                 // Set Next qTD pointer T bit to 1
        ptr_qH->DW5.T = 1U;                 // Set Alternate Next qTD pointer T bit to 1
        ptr_qH++;
    }
}

/**
  \fn          USBH_EHCI_qH *USBH_EHCI_qH_GetFree (uint8_t ctrl)
  \brief       Get free queue Head
  \param[in]   ctrl        Index of USB Host controller
  \return                  Pointer to first free queue Head, no free or function failed
               value > 0:  pointer to first free queue Head
               value = 0:  no free queue Head exists or function failed
*/
static USBH_EHCI_qH *USBH_EHCI_qH_GetFree(uint8_t ctrl)
{
    USBH_EHCI_qH *ptr_qH;
    uint32_t      cnt;

    ptr_qH = (USBH_EHCI_qH *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_qH);

    if (ptr_qH == NULL)
    {
        return NULL;
    }

    cnt = (usbh_ehci_ptr[ctrl])->max_qH;

    while (cnt != 0U)
    {
        cnt--;

        if (ptr_qH->DW1.MaxPcktLen == 0U)
        {
            return ptr_qH;
        }

        ptr_qH++;
    }

    return NULL;
}

/**
  \fn          void *USBH_EHCI_PE_GetFree (uint8_t ctrl, uint8_t type)
  \brief       Get free Periodic Element (qH/iTD/siTD)
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   type        Type of Periodic Element
  \return                  Pointer to first free qH/iTD/siTD, no next or function failed
               value > 0:  pointer to first free qH/iTD/siTD
               value = 0:  no free qH/iTD/siTD exists or function failed
*/
static void *USBH_EHCI_PE_GetFree(uint8_t ctrl, uint8_t type)
{
    USBH_EHCI_qH   *ptr_qH;
    USBH_EHCI_iTD  *ptr_iTD;
    USBH_EHCI_siTD *ptr_siTD;
    uint32_t        cnt;

    switch (type & 3U)
    {
        case USBH_EHCI_ELEMENT_TYPE_iTD:
            ptr_iTD = (USBH_EHCI_iTD *)((usbh_ehci_ptr[ctrl])->ptr_iTD);

            if (ptr_iTD == NULL)
            {
                return NULL;
            }

            cnt = (usbh_ehci_ptr[ctrl])->max_iTD;

            while (cnt != 0U)
            {
                cnt--;

                if (ptr_iTD->DW9.DevAddr == 0U)
                {
                    return ptr_iTD;
                }

                ptr_iTD++;
            }

            break;

        case USBH_EHCI_ELEMENT_TYPE_qH:
            ptr_qH = (USBH_EHCI_qH *)((usbh_ehci_ptr[ctrl])->ptr_qH);

            if (ptr_qH == NULL)
            {
                return NULL;
            }

            cnt = (usbh_ehci_ptr[ctrl])->max_qH;

            while (cnt != 0U)
            {
                cnt--;

                if (ptr_qH->DW1.MaxPcktLen == 0U)
                {
                    return ptr_qH;
                }

                ptr_qH++;
            }

            break;

        case USBH_EHCI_ELEMENT_TYPE_siTD:
            ptr_siTD = (USBH_EHCI_siTD *)((usbh_ehci_ptr[ctrl])->ptr_siTD);

            if (ptr_siTD == NULL)
            {
                return NULL;
            }

            cnt = (usbh_ehci_ptr[ctrl])->max_siTD;

            while (cnt != 0U)
            {
                cnt--;

                if (ptr_siTD->DW1.DevAddr == 0U)
                {
                    return ptr_siTD;
                }

                ptr_siTD++;
            }

            break;

        case USBH_EHCI_ELEMENT_TYPE_FSTN:
            break;
    }

    return NULL;
}

/**
  \fn          USBH_EHCI_qH *USBH_EHCI_qH_GetPrevious (uint8_t ctrl, USBH_EHCI_qH *ptr_qH)
  \brief       Get previous queue Head linked to this one (before it)
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qH      Pointer to queue Head to start search from
  \return                  Pointer to previous queue Head, no previous or function failed
               value > 0:  pointer to previous queue Head
               value = 0:  no previous queue Head exists or function failed
*/
static USBH_EHCI_qH *USBH_EHCI_qH_GetPrevious(uint8_t ctrl, USBH_EHCI_qH *ptr_qH)
{
    USBH_EHCI_qH *ptr_prev_qH;
    uint32_t      cnt;

    if (ptr_qH == NULL)
    {
        return NULL;
    }

    ptr_prev_qH = (USBH_EHCI_qH *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_qH);

    if (ptr_prev_qH == NULL)
    {
        return NULL;
    }

    cnt = (usbh_ehci_ptr[ctrl])->max_qH;

    while (cnt != 0U)
    {
        cnt--;

        if ((ptr_prev_qH->DW0.T == 0U) && (((uint32_t)ptr_prev_qH->DW0.HorizLinkPtr << 5) == (uint32_t)ptr_qH))
        {
            return ptr_prev_qH;
        }

        ptr_prev_qH++;
    }

    return NULL;
}

/**
  \fn          USBH_EHCI_qH *USBH_EHCI_qH_GetLast (USBH_EHCI_qH *ptr_qH)
  \brief       Get last queue Head starting from requested one
  \param[in]   ptr_qH      Pointer to queue Head to start search from
  \return                  Pointer to last chained queue Head starting from requested one, no last or function failed
               value > 0:  pointer to last chained queue Head starting from requested one
               value = 0:  no last last chained queue Head starting from requested one or function failed
*/
static USBH_EHCI_qH *USBH_EHCI_qH_GetLast(USBH_EHCI_qH *ptr_qH)
{
    USBH_EHCI_qH *ptr_qH_;
    uint32_t      addr;

    if (ptr_qH == NULL)
    {
        return NULL;
    }

    ptr_qH_ = ptr_qH;

    addr = (uint32_t)ptr_qH_->DW0.HorizLinkPtr << 5;

    while ((ptr_qH_->DW0.T == 0U) && (ptr_qH_->DW0.HorizLinkPtr != 0U) && ((((USBH_EHCI_qH *)addr)->DW1.H) == 0U))
    {
        ptr_qH_ = (USBH_EHCI_qH *)addr;
        addr    = (uint32_t)ptr_qH_->DW0.HorizLinkPtr << 5;
    }

