OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    return ptr_qH_;
}

/**
  \fn          USBH_EHCI_qH *USBH_EHCI_qH_Unlink (USBH_EHCI_qH *ptr_first_qH, USBH_EHCI_qH *ptr_qH)
  \brief       Unlink queue Head from queue Head linked list and
               return pointer to beginning of the linked list queue Head
  \param[in]   ptr_first_qH  Pointer to first queue Head in the linked list
  \param[in]   ptr_qH        Pointer to queue Head
  \return                    Pointer to beginning of the linked list, queue Head not found or function failed
               value > 0:    pointer to beginning of the linked list
               value = 0:    queue Head not found or function failed
*/
static USBH_EHCI_qH *USBH_EHCI_qH_Unlink(USBH_EHCI_qH *ptr_first_qH, USBH_EHCI_qH *ptr_qH)
{
    const USBH_EHCI_qH *ptr_qH_;
    USBH_EHCI_qH *ptr_first_qH_, *ptr_curr_qH, *ptr_next_qH;
    uint32_t      addr;

    if (ptr_first_qH->DW0.T == 0U)
    {
        addr          = (uint32_t)ptr_first_qH & ~0x1FU;
        ptr_first_qH_ = (USBH_EHCI_qH *)addr;
    }
    else
    {
        ptr_first_qH_ = NULL;
    }

    addr         = (uint32_t)ptr_qH & ~0x1FU;
    ptr_qH_      = (USBH_EHCI_qH *)addr;

    if ((ptr_first_qH_ == NULL) || (ptr_qH_ == NULL))
    {
        return ptr_first_qH_;
    }

    ptr_curr_qH  =  ptr_first_qH_;

    if (ptr_curr_qH->DW0.T == 0U)
    {
        addr        = (uint32_t)ptr_curr_qH->DW0.HorizLinkPtr << 5;
        ptr_next_qH = (USBH_EHCI_qH *)addr;
    }
    else
    {
        ptr_next_qH = NULL;
    }

    // Handle special case if first element is one that needs to be unlinked
    if (ptr_curr_qH == ptr_qH_)           // If first element is requested one
    {
        if ((ptr_next_qH == ptr_curr_qH) || // If element is linked to itself or
                (ptr_next_qH == NULL))          // if this is last element in list
        {
            return NULL;                      // Start of the list is now 0
        }
        else                                // There is a valid next element
        {
            ptr_first_qH_ = ptr_next_qH;
            ptr_curr_qH   = ptr_next_qH;

            if (ptr_curr_qH->DW0.T == 0U)
            {
                addr        = (uint32_t)ptr_curr_qH->DW0.HorizLinkPtr << 5;
                ptr_next_qH = (USBH_EHCI_qH *)addr;
            }
            else
            {
                ptr_next_qH = NULL;
            }
        }
    }

    while (ptr_next_qH != NULL)           // While next element is valid
    {
        if (ptr_next_qH == ptr_qH_)         // If next element is requested one
        {
            if (ptr_next_qH->DW0.T == 0U)     // If next element exists
            {
                addr        = (uint32_t)ptr_next_qH->DW0.HorizLinkPtr << 5;
                ptr_next_qH = (USBH_EHCI_qH *)addr;
                ptr_curr_qH->DW0.HorizLinkPtr = (uint32_t)(ptr_next_qH) >> 5;
                ptr_curr_qH->DW0.T = ptr_next_qH->DW0.T;
            }
            else                              // If next element does not exist make curr last
            {
                ptr_curr_qH->DW0.HorizLinkPtr = 0U;
                ptr_curr_qH->DW0.T = 1U;
            }

            break;
        }

        ptr_curr_qH = ptr_next_qH;

        if (ptr_next_qH->DW0.T == 0U)
        {
            addr        = (uint32_t)ptr_next_qH->DW0.HorizLinkPtr << 5;
            ptr_next_qH = (USBH_EHCI_qH *)addr;
        }
        else
        {
            ptr_next_qH = NULL;
        }
    }

    return ptr_first_qH_;
}

/**
  \fn          void *USBH_EHCI_PE_Unlink (void *ptr_first_pe, void *ptr_pe)
  \brief       Unlink Periodic Element (qH/iTD/siTD) from Periodic Element (qH/iTD/siTD) linked list and
               return pointer to beginning of the linked list Periodic Element (qH/iTD/siTD)
  \param[in]   ptr_first_pe  Pointer to first Periodic Element (qH/iTD/siTD) in the linked list
  \param[in]   ptr_pe        Pointer to Periodic Element (qH/iTD/siTD)
  \return                    Pointer to beginning of the linked list, Periodic Element (qH/iTD/siTD) not found or function failed
               value > 0:    pointer to beginning of the linked list
               value = 0:    Periodic Element (qH/iTD/siTD) not found or function failed
*/
static void *USBH_EHCI_PE_Unlink(void *ptr_first_pe, void *ptr_pe)
{
    USBH_EHCI_COMMON *ptr_curr, *ptr_next;
    void             *ptr_new_first;

    if ((ptr_first_pe == NULL) || (ptr_pe == NULL))
    {
        return NULL;
    }

    ptr_curr      = (USBH_EHCI_COMMON *)ptr_first_pe;
    ptr_new_first = ptr_first_pe;

    if (ptr_first_pe == ptr_pe)
    {
        // If first element should be unlinked
        if (ptr_curr->DW0.T == 0U)
        {
            ptr_new_first = (void *)(ptr_curr->DW0.LinkPtr << 5);
            ptr_curr->DW0.T = 1U;
        }
        else
        {
            ptr_new_first = NULL;
        }
    }
    else
    {
        // If we need to find element to unlink
        while ((ptr_curr->DW0.T == 0U) && (ptr_curr->DW0.LinkPtr != 0U) && ((((uint32_t)ptr_curr->DW0.LinkPtr) << 5) != (uint32_t)ptr_pe))
        {
            ptr_curr = (USBH_EHCI_COMMON *)(ptr_curr->DW0.LinkPtr << 5);
        }

        if ((ptr_curr->DW0.T == 0U) && (ptr_curr->DW0.LinkPtr != 0U) && ((((uint32_t)ptr_curr->DW0.LinkPtr) << 5) == (uint32_t)ptr_pe))
        {
            // If next of current shows to the one we want to remove
            ptr_next = (USBH_EHCI_COMMON *)(ptr_curr->DW0.LinkPtr << 5);
            ptr_curr->DW0.LinkPtr = ptr_next->DW0.LinkPtr;
            ptr_curr->DW0.T       = ptr_next->DW0.T;
        }
    }

    return ptr_new_first;
}

/**
  \fn          uint32_t USBH_EHCI_qH_CountIntEntries (uint8_t ctrl, USBH_EHCI_qH *ptr_qH)
  \brief       Count number of times Interrupt queue Head is found in Periodic Frame List
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qH      Pointer to Interrupt queue Head
  \return                  Number of times Interrupt queue Head is found in Periodic Frame List
*/
static uint32_t USBH_EHCI_qH_CountIntEntries(uint8_t ctrl, const USBH_EHCI_qH *ptr_qH)
{
    const uint32_t     *ptr_uint32_t;
    const USBH_EHCI_qH *ptr_tmp_qH;
    uint32_t      pfl_sz;
    uint32_t      i, cnt;
    uint32_t      addr;

    if (ptr_qH == NULL)
    {
        return 0U;
    }

    pfl_sz = USBH_EHCI_PFL_GetSize(ctrl);
    cnt    = 0U;

    ptr_uint32_t = (usbh_ehci_ptr[ctrl])->ptr_PFL;

