OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    for (i = 0U; i < pfl_sz; i++)
    {
        if ((*ptr_uint32_t & 1U) == 0U)     // If T is cleared then this is a valid pointer
        {
            addr       = *ptr_uint32_t &(~0x1FU);
            ptr_tmp_qH = (USBH_EHCI_qH *)addr;

            while (ptr_tmp_qH != NULL)
            {
                if (ptr_tmp_qH == ptr_qH)
                {
                    cnt++;
                }

                if (ptr_tmp_qH->DW0.T == 0U)
                {
                    addr       = (uint32_t)ptr_qH->DW0.HorizLinkPtr << 5;
                    ptr_tmp_qH = (USBH_EHCI_qH *)addr;
                }
                else
                {
                    ptr_tmp_qH =  NULL;
                }
            }
        }

        ptr_uint32_t++;
    }

    return cnt;
}

/**
  \fn          bool USBH_EHCI_qH_ClearIntEntries (uint8_t ctrl, USBH_EHCI_qH *ptr_qH)
  \brief       Clear entries in Periodic Frame List for Interrupt queue Head
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qH      Pointer to queue Head
  \return      true = success, false = fail
*/
static bool USBH_EHCI_qH_ClearIntEntries(uint8_t ctrl, USBH_EHCI_qH *ptr_qH)
{
    USBH_EHCI_qH *ptr_first_qH;
    uint32_t     *ptr_uint32_t;
    uint32_t      pfl_sz;

    if (ptr_qH == NULL)
    {
        return false;
    }

    pfl_sz       = USBH_EHCI_PFL_GetSize(ctrl);

    if (pfl_sz == 0U)
    {
        return false;
    }

    ptr_uint32_t = (usbh_ehci_ptr[ctrl])->ptr_PFL;

    while (pfl_sz != 0U)
    {
        pfl_sz--;

        if ((*ptr_uint32_t & 1U) == 0U)               // If T is 0, meaning pointer is valid
        {
            ptr_first_qH = USBH_EHCI_qH_Unlink((USBH_EHCI_qH *)(*ptr_uint32_t), ptr_qH);

            if (ptr_first_qH == NULL)
            {
                *ptr_uint32_t = 1U;                       // T = 1, no qH linked
            }
            else
            {
                *ptr_uint32_t = (*ptr_uint32_t & 0x1FU) | (uint32_t)(ptr_first_qH);
            }
        }

        ptr_uint32_t++;
    }

    return true;
}

/**
  \fn          bool USBH_EHCI_PFL_PE_Remove (uint8_t ctrl, void *ptr_pe)
  \brief       Remove entries from Periodic Frame List for Periodic Element (qH/iTD/siTD)
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_pe      Pointer to Periodic Element (qH/iTD/siTD)
  \return      true = success, false = fail
*/
static bool USBH_EHCI_PFL_PE_Remove(uint8_t ctrl, void *ptr_pe)
{
    void     *ptr_new_first;
    uint32_t *ptr_uint32_t;
    uint32_t  pfl_sz;

    if (ptr_pe == NULL)
    {
        return false;
    }

    pfl_sz       = USBH_EHCI_PFL_GetSize(ctrl);

    if (pfl_sz == 0U)
    {
        return false;
    }

    ptr_uint32_t = (usbh_ehci_ptr[ctrl])->ptr_PFL;

    while (pfl_sz != 0U)
    {
        pfl_sz--;

        if ((*ptr_uint32_t & 1U) == 0U)               // If T is 0, meaning pointer is valid
        {
            ptr_new_first = USBH_EHCI_PE_Unlink((void *)((*ptr_uint32_t) & (~0x1FU)), ptr_pe);

            if (ptr_new_first == NULL)
            {
                *ptr_uint32_t = 1U;                       // T = 1, no Periodic Element linked
            }
            else
            {
                *ptr_uint32_t = (uint32_t)(ptr_new_first);
            }
        }

        ptr_uint32_t++;
    }

    return true;
}

/**
  \fn          uint32_t USBH_EHCI_CalcIntEntriesNum (uint8_t ctrl, uint8_t interval)
  \brief       Calculate number of entries in Periodic Frame List for Interrupt queue Head
               required to achieve requested polling interval
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   interval    Endpoint interval (in SOF or uSOF intervals)
  \return      Number of entries in Periodic Frame List required to achieve requested polling interval
*/
static uint32_t USBH_EHCI_CalcIntEntriesNum(uint8_t ctrl, uint32_t interval)
{
    uint32_t pfl_sz;

    pfl_sz = USBH_EHCI_PFL_GetSize(ctrl);

    if (interval > pfl_sz)                // Special case only 1 entry
    {
        return 1U;
    }

    if (interval <= 1U)                   // Special case all entries
    {
        return pfl_sz;
    }

    while (((pfl_sz % interval) != 0U) && (interval > 1U))
    {
        interval--;
    }

    return (pfl_sz / interval);
}

/**
  \fn          bool USBH_EHCI_qH_SetIntEntries (uint8_t ctrl, USBH_EHCI_qH *ptr_qH, uint8_t ep_speed, uint8_t ep_interval)
  \brief       Set queue Head entries in Periodic Frame List for Interrupt Endpoint
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qH      Pointer to queue Head
  \param[in]   ep_speed    Endpoint speed
  \param[in]   ep_interval Endpoint polling interval
  \return      true = success, false = fail
*/
static bool USBH_EHCI_qH_SetIntEntries(uint8_t ctrl, USBH_EHCI_qH *ptr_qH, uint8_t ep_speed, uint8_t ep_interval)
{
    USBH_EHCI_qH *ptr_tmp_qH;
    USBH_EHCI_qH *ptr_prev_qH;
    uint32_t     *ptr_uint32_t;
    uint32_t      num, step, interval, i;
    uint32_t      addr;

    if (USBH_EHCI_qH_ClearIntEntries(ctrl, ptr_qH) == false)
    {
        return false;
    }

    if (ep_interval == 0U)
    {
        interval = 1U;
    }
    else
    {
        switch (ep_speed)
        {
            case ARM_USB_SPEED_LOW:
            case ARM_USB_SPEED_FULL:
                interval = ep_interval;
                break;

            case ARM_USB_SPEED_HIGH:
                if (ep_interval > 16U)
                {
                    // Out of bounds value
                    interval = 32768U;
                }
                else
                {
                    // Convert bInterval to interval in uSOFs
                    interval = 2UL << ((uint32_t)ep_interval - 1U);
                }

                break;

            default:
                return false;
        }
    }

    num  = USBH_EHCI_CalcIntEntriesNum(ctrl, interval);
    step = USBH_EHCI_PFL_GetSize(ctrl) / num;

    ptr_prev_qH = NULL;

    // Search for qH which has same number or more entries then requested qH,
    // and if found link requested qH in front of found qH, otherwise link
    // requested qH after last qH
    ptr_uint32_t = (uint32_t *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_PFL);
    addr         = *ptr_uint32_t &(~0x1FU);
    ptr_tmp_qH   = (USBH_EHCI_qH *)addr;

    if ((*ptr_uint32_t & 1U) == 0U)
    {
        // If starting table pointer is not empty find where new qH should be added
        for (;;)
        {
            if (USBH_EHCI_qH_CountIntEntries(ctrl, ptr_tmp_qH) >= num)
            {
                // We need to put new qH in front of current one
                ptr_prev_qH = USBH_EHCI_qH_GetPrevious(ctrl, ptr_tmp_qH);
                ptr_qH->DW0.HorizLinkPtr = (uint32_t)ptr_tmp_qH >> 5;
                ptr_qH->DW0.T = 0U;               // T = 0, not last entry

                if (ptr_prev_qH != NULL)
                {
                    ptr_prev_qH->DW0.HorizLinkPtr = (uint32_t)ptr_qH >> 5;
                }

                break;
            }
            else if (ptr_tmp_qH->DW0.HorizLinkPtr != 0U)
            {
                // Go to next qH in chain as we have not found where to put new qH yet
                addr       = (uint32_t)ptr_tmp_qH->DW0.HorizLinkPtr << 5;
                ptr_tmp_qH = (USBH_EHCI_qH *)addr;
            }
            else
            {
                // We need to put new qH at the end
                ptr_prev_qH = ptr_tmp_qH;
                ptr_tmp_qH->DW0.HorizLinkPtr = (uint32_t)ptr_qH >> 5;
                ptr_tmp_qH->DW0.T = 0U;         // T = 0, is not last entry any more
                ptr_qH->DW0.T     = 1U;         // T = 1, is last entry
                break;
            }
        }
    }

    // Find any corresponding table pointer that should start with requested qH
    ptr_uint32_t = (uint32_t *)((usbh_ehci_ptr[ctrl])->ptr_PFL);

    for (i = 0U; i < num; i++)
    {
        if (((*ptr_uint32_t & 1U) == 1U) ||                 // If empty pointer (T == 1) or
                (ptr_prev_qH == NULL))                         // if no previous qH
        {
            *ptr_uint32_t = (uint32_t)ptr_qH | (1UL << 1);    // Typ = QH, T = 0
        }

        ptr_uint32_t += step;
    }

