OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    return true;
}

/**
  \fn          void USBH_EHCI_TI_ClearAll (uint8_t ctrl)
  \brief       Clear all Transfer Info entries
  \param[in]   ctrl        Index of USB Host controller
*/
static void USBH_EHCI_TI_ClearAll(uint8_t ctrl)
{

    memset((usbh_ehci_ptr[ctrl])->ptr_TI, 0, (USBH_EHCI_MAX_PIPES)*sizeof(USBH_TransferInfo_t));
}

/**
  \fn          USBH_TransferInfo_t *USBH_EHCI_TI_GetFree (uint8_t ctrl)
  \brief       Get Free Transfer Info entry
  \param[in]   ctrl        Index of USB Host controller
  \return                  Pointer to first free Transfer Info entry, no free or function failed
               value > 0:  pointer to first free Transfer Info entry
               value = 0:  no free Transfer Info entry or function failed
*/
static USBH_TransferInfo_t *USBH_EHCI_TI_GetFree(uint8_t ctrl)
{
    USBH_TransferInfo_t *ptr_TI;
    uint32_t             cnt;

    ptr_TI = (usbh_ehci_ptr[ctrl])->ptr_TI;

    if (ptr_TI == NULL)
    {
        return NULL;
    }

    cnt = (usbh_ehci_ptr[ctrl])->max_qTD;

    while (cnt != 0U)
    {
        cnt--;

        if (ptr_TI->ptr_pipe == NULL)
        {
            return ptr_TI;
        }

        ptr_TI++;
    }

    return NULL;
}

/**
  \fn          USBH_TransferInfo_t *USBH_EHCI_TI_Find_qTD (uint8_t ctrl, USBH_EHCI_qTD *ptr_qTD)
  \brief       Get Transfer Info entry referring to queue element Transfer Descriptor
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qTD     Pointer to queue element Transfer Descriptor to find
  \return                  Pointer to Transfer Info entry, no corresponding entry or function failed
               value > 0:  pointer to Transfer Info entry
               value = 0:  no Transfer Info entry found or function failed
*/
static USBH_TransferInfo_t *USBH_EHCI_TI_Find_qTD(uint8_t ctrl, USBH_EHCI_qTD *ptr_qTD)
{
    USBH_TransferInfo_t *ptr_TI;
    uint32_t             cnt;

    if (ptr_qTD == NULL)
    {
        return NULL;
    }

    ptr_TI = (usbh_ehci_ptr[ctrl])->ptr_TI;

    if (ptr_TI == NULL)
    {
        return NULL;
    }

    cnt = (usbh_ehci_ptr[ctrl])->max_qTD;

    while (cnt != 0U)
    {
        cnt--;

        if (((uint32_t)ptr_TI->ptr_transfer & ~0x1FU) == (uint32_t)ptr_qTD)
        {
            return ptr_TI;
        }

        ptr_TI++;
    }

    return NULL;
}

/**
  \fn          USBH_TransferInfo_t *USBH_EHCI_TI_Find_qH (uint8_t ctrl, USBH_EHCI_qH *ptr_qH)
  \brief       Get Transfer Info entry referring to queue Head
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_qH      Pointer to queue Head to find
  \return                  Pointer to Transfer Info entry, no corresponding entry or function failed
               value > 0:  pointer to Transfer Info entry
               value = 0:  no Transfer Info entry found or function failed
*/
static USBH_TransferInfo_t *USBH_EHCI_TI_Find_qH(uint8_t ctrl, USBH_EHCI_qH *ptr_qH)
{
    USBH_TransferInfo_t *ptr_TI;
    uint32_t             cnt;

    if (ptr_qH == NULL)
    {
        return NULL;
    }

    ptr_TI = (usbh_ehci_ptr[ctrl])->ptr_TI;

    if (ptr_TI == NULL)
    {
        return NULL;
    }

    cnt = (usbh_ehci_ptr[ctrl])->max_qH;

    while (cnt != 0U)
    {
        cnt--;

        if ((uint32_t)ptr_TI->ptr_pipe == (uint32_t)ptr_qH)
        {
            return ptr_TI;
        }

        ptr_TI++;
    }

    return NULL;
}

/**
  \fn          USBH_TransferInfo_t *USBH_EHCI_TI_Find_PE (uint8_t ctrl, void *ptr_pe)
  \brief       Get Transfer Info entry referring to Periodic Element (qH/iTD/siTD)
  \param[in]   ctrl        Index of USB Host controller
  \param[in]   ptr_pe      Pointer to Periodic Element (qH/iTD/siTD) to find
  \return                  Pointer to Transfer Info entry, no corresponding entry or function failed
               value > 0:  pointer to Transfer Info entry
               value = 0:  no Transfer Info entry found or function failed
*/
static USBH_TransferInfo_t *USBH_EHCI_TI_Find_PE(uint8_t ctrl, void *ptr_pe)
{
    USBH_TransferInfo_t *ptr_TI;
    uint32_t             cnt;

    if (ptr_pe == NULL)
    {
        return NULL;
    }

    ptr_TI = (usbh_ehci_ptr[ctrl])->ptr_TI;

    if (ptr_TI == NULL)
    {
        return NULL;
    }

    cnt = (usbh_ehci_ptr[ctrl])->max_qH;

    while (cnt != 0U)
    {
        cnt--;

        if ((uint32_t)ptr_TI->ptr_pipe      == (uint32_t)ptr_pe)
        {
            return ptr_TI;
        }

        if ((uint32_t)ptr_TI->iso_ptr_pipe1 == (uint32_t)ptr_pe)
        {
            return ptr_TI;
        }

        ptr_TI++;
    }

    return NULL;
}

// Driver functions ***********************************************************

/**
  \fn          ARM_DRIVER_VERSION USBH_HW_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION USBH0_HW_GetVersion(void)
{
    return usbh_driver_version;
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static ARM_DRIVER_VERSION USBH1_HW_GetVersion(void)
{
    return usbh_driver_version;
}
#endif

/**
  \fn          ARM_USBH_CAPABILITIES USBH_HW_GetCapabilities (uint8_t ctrl)
  \brief       Get driver capabilities.
  \param[in]   ctrl  Index of USB Host controller
  \return      \ref ARM_USBH_CAPABILITIES
*/
static ARM_USBH_CAPABILITIES USBH_HW_GetCapabilities(uint8_t ctrl)
{
    uint32_t port_num = (usbh_ehci_reg_ptr[ctrl]->EHCSPR & 0xFU);

    if (port_num == 0U)
    {
        port_num = 1U;
    }

    usbh_driver_capabilities[ctrl].port_mask = (1U << port_num) - 1U;

    return usbh_driver_capabilities[ctrl];
}
static ARM_USBH_CAPABILITIES USBH0_HW_GetCapabilities(void)
{
    return USBH_HW_GetCapabilities(0);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static ARM_USBH_CAPABILITIES USBH1_HW_GetCapabilities(void)
{
    return USBH_HW_GetCapabilities(1);
}
#endif

/**
  \fn          int32_t USBH_HW_Initialize (uint8_t                    ctrl,
                                           ARM_USBH_SignalPortEvent_t cb_port_event,
                                           ARM_USBH_SignalPipeEvent_t cb_pipe_event)
  \brief       Initialize USB Host Interface.
  \param[in]   ctrl           Index of USB Host controller
  \param[in]   cb_port_event  Pointer to \ref ARM_USBH_SignalPortEvent
  \param[in]   cb_pipe_event  Pointer to \ref ARM_USBH_SignalPipeEvent
  \return      \ref execution_status
*/
static int32_t USBH_HW_Initialize(uint8_t ctrl, ARM_USBH_SignalPortEvent_t cb_port_event, ARM_USBH_SignalPipeEvent_t cb_pipe_event)
{
    int32_t ret;

    if (ctrl >= USBH_EHCI_TT_INSTANCES)
    {
        return ARM_DRIVER_ERROR;
    }

    usbh_ehci_reg_ptr[ctrl] = (HSUSBH_T *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_EHCI);

    signal_port_event[ctrl] = cb_port_event;
    signal_pipe_event[ctrl] = cb_pipe_event;

    (void)USBH_HW_GetCapabilities(ctrl);

    port_act[ctrl] = 0U;
    pfl_size[ctrl] = USBH_EHCI_PFL_GetSize(ctrl);

    USBH_EHCI_TI_ClearAll(ctrl);

