OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    ret = USBH_EHCI_HW_Initialize((uint8_t)(usbh_ehci_ptr[ctrl])->ctrl, (usbh_ehci_ptr[ctrl])->irq_handler);

    if (ret != 0)
    {
        return ARM_DRIVER_ERROR;
    }

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_Initialize(ARM_USBH_SignalPortEvent_t cb_port_event, ARM_USBH_SignalPipeEvent_t cb_pipe_event)
{
    return USBH_HW_Initialize(0, cb_port_event, cb_pipe_event);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_Initialize(ARM_USBH_SignalPortEvent_t cb_port_event, ARM_USBH_SignalPipeEvent_t cb_pipe_event)
{
    return USBH_HW_Initialize(1, cb_port_event, cb_pipe_event);
}
#endif

/**
  \fn          int32_t USBH_HW_Uninitialize (uint8_t ctrl)
  \brief       De-initialize USB Host Interface.
  \param[in]   ctrl  Index of USB Host controller
  \return      \ref execution_status
*/
static int32_t USBH_HW_Uninitialize(uint8_t ctrl)
{
    int32_t ret;
    uint32_t timeout = 10;

    usbh_ehci_reg_ptr[ctrl]->UCMDR &= ~(HSUSBH_UCMDR_RUN_Msk);

    while (timeout > 0)
    {
        if ((usbh_ehci_reg_ptr[ctrl]->USTSR & HSUSBH_USTSR_HCHalted_Msk) == HSUSBH_USTSR_HCHalted_Msk)
            break;

        delay_ms(1U);
        timeout -= 1;

        if (timeout == 0)
        {
            return ARM_DRIVER_ERROR;
        }
    }

    ret = USBH_EHCI_HW_Uninitialize((uint8_t)(usbh_ehci_ptr[ctrl])->ctrl);

    if (ret != 0)
    {
        return ARM_DRIVER_ERROR;
    }

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_Uninitialize(void)
{
    return USBH_HW_Uninitialize(0);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_Uninitialize(void)
{
    return USBH_HW_Uninitialize(1);
}
#endif

/**
  \fn          int32_t USBH_HW_PowerControl (uint8_t ctrl, ARM_POWER_STATE state)
  \brief       Control USB Host Interface Power.
  \param[in]   ctrl   Index of USB Host controller
  \param[in]   state  Power state
  \return      \ref execution_status
*/
static int32_t USBH_HW_PowerControl(uint8_t ctrl, ARM_POWER_STATE state)
{
    int32_t  status;
    uint32_t tout;

    switch (state)
    {
        case ARM_POWER_OFF:
            usbh_ehci_reg_ptr[ctrl]->UIENR = 0U;    // Disable all EHCI interrupts
            usbh_ehci_reg_ptr[ctrl]->UCMDR = 0U;    // Host Controller Stop

            // Wait for stop, max 1 sec
            tout = 10100;

            while ((usbh_ehci_reg_ptr[ctrl]->USTSR & (1UL << 12)) == 0U)   // While not halted
            {
                if (tout <= 100U)
                {
                    if (tout == 0U)
                    {
                        return ARM_DRIVER_ERROR;
                    }

                    (void)delay_ms(10U);
                }

                tout--;
            }

            status = USBH_EHCI_HW_PowerControl((uint8_t)(usbh_ehci_ptr[ctrl])->ctrl, 0U);

            if (status != 0)
            {
                return ARM_DRIVER_ERROR;
            }

            break;

        case ARM_POWER_LOW:
            return ARM_DRIVER_ERROR_UNSUPPORTED;

        case ARM_POWER_FULL:
            status = USBH_EHCI_HW_PowerControl((uint8_t)(usbh_ehci_ptr[ctrl])->ctrl, 1U);

            if (status != 0)
            {
                return ARM_DRIVER_ERROR;
            }

            // Initialize memories
            USBH_EHCI_PFL_Clear(ctrl);
            USBH_EHCI_qTD_ClearAll(ctrl);
            USBH_EHCI_qH_ClearAll(ctrl);
            USBH_EHCI_TI_ClearAll(ctrl);

            usbh_ehci_reg_ptr[ctrl]->UCMDR |= (1UL << 1);    // Host Controller Reset

            // Wait for reset to finish, max 1 sec
            tout = 10100;

            while ((usbh_ehci_reg_ptr[ctrl]->UCMDR & (1UL << 1)) != 0U)
            {
                if (tout <= 100U)
                {
                    if (tout == 0U)
                    {
                        return ARM_DRIVER_ERROR;
                    }

                    (void)delay_ms(10U);
                }

                tout--;
            }

            usbh_ehci_reg_ptr[ctrl]->UPSCR[0] = 0x22U;       // Controller Mode=Host Mode, VBPS Hi
            usbh_ehci_reg_ptr[ctrl]->UIENR   = HSUSBH_UIENR_USBIEN_Msk | HSUSBH_UIENR_UERRIEN_Msk | HSUSBH_UIENR_PCIEN_Msk; // Enable needed interrupts
            usbh_ehci_reg_ptr[ctrl]->UPFLBAR = (uint32_t)(usbh_ehci_ptr[ctrl])->ptr_PFL; // PFL

            //* enable port routing to EHCI           */
            usbh_ehci_reg_ptr[ctrl]->UCFGR |= HSUSBH_UCFGR_CF_Msk;

            // Wait for run to activate, max 1 sec
            usbh_ehci_reg_ptr[ctrl]->UCMDR = UCMDR_INT_THR_CTRL | HSUSBH_UCMDR_RUN_Msk; // Host Controller Run
            tout = 10100;

            while ((usbh_ehci_reg_ptr[ctrl]->USTSR & (1UL << 12)) != 0U)   // While halted
            {
                if (tout <= 100U)
                {
                    if (tout == 0U)
                    {
                        return ARM_DRIVER_ERROR;
                    }

                    (void)delay_ms(10U);
                }

                tout--;
            }

            //Pre Power on Port ??
            usbh_ehci_reg_ptr[ctrl]->UPSCR[0] |=  HSUSBH_UPSCR_PP_Msk;
            //usbh_ehci_reg_ptr[ctrl]->TTCTRL = 0U;             // Hub not used for FS and LS devices
            break;
    }

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PowerControl(ARM_POWER_STATE state)
{
    return USBH_HW_PowerControl(0, state);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PowerControl(ARM_POWER_STATE state)
{
    return USBH_HW_PowerControl(1, state);
}
#endif

/**
  \fn          int32_t USBH_HW_PortVbusOnOff (uint8_t ctrl, uint8_t port, bool vbus)
  \brief       Root HUB Port VBUS on/off.
  \param[in]   ctrl  Index of USB Host controller
  \param[in]   port  Root HUB Port Number
  \param[in]   vbus
                - \b false VBUS off
                - \b true  VBUS on
  \return      \ref execution_status
*/
static int32_t USBH_HW_PortVbusOnOff(uint8_t ctrl, uint8_t port, bool vbus)
{

    if ((usbh_driver_capabilities[ctrl].port_mask & (1UL << port)) == 0U)
    {
        // If port is not available
        return ARM_DRIVER_ERROR;
    }

    if (vbus)
    {
        usbh_ehci_reg_ptr[ctrl]->UPSCR[port] |=  HSUSBH_UPSCR_PP_Msk;
    }
    else
    {
        usbh_ehci_reg_ptr[ctrl]->UPSCR[port] &= ~HSUSBH_UPSCR_PP_Msk;
    }

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PortVbusOnOff(uint8_t port, bool vbus)
{
    return USBH_HW_PortVbusOnOff(0, port, vbus);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PortVbusOnOff(uint8_t port, bool vbus)
{
    return USBH_HW_PortVbusOnOff(1, port, vbus);
}
#endif

/**
  \fn          int32_t USBH_HW_PortReset (uint8_t ctrl, uint8_t port)
  \brief       Do Root HUB Port Reset.
  \param[in]   ctrl  Index of USB Host controller
  \param[in]   port  Root HUB Port Number
  \return      \ref execution_status
*/
static int32_t USBH_HW_PortReset(uint8_t ctrl, uint8_t port)
{
    uint32_t tout;

    if ((usbh_driver_capabilities[ctrl].port_mask & (1UL << port)) == 0U)
    {
        // If port is not available
        return ARM_DRIVER_ERROR;
    }

    usbh_ehci_reg_ptr[ctrl]->UPSCR[port] &= ~HSUSBH_UPSCR_PE_Msk;    // Clear Port Enable
    usbh_ehci_reg_ptr[ctrl]->UPSCR[port] |=  HSUSBH_UPSCR_PRST_Msk;      // Port Reset

