OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    tout = 5U;

    while ((usbh_ehci_reg_ptr[ctrl]->UPSCR[port] & HSUSBH_UPSCR_PRST_Msk) != 0U)
    {
        if (tout <= 5U)
        {
            if (tout == 0U)
            {
                usbh_ehci_reg_ptr[ctrl]->UPSCR[port] &= ~HSUSBH_UPSCR_PRST_Msk;
            }

            (void)delay_ms(10U);
        }

        tout--;
    }

    if (((usbh_ehci_reg_ptr[ctrl]->UPSCR[port] & HSUSBH_UPSCR_CCS_Msk) == 0) || ((usbh_ehci_reg_ptr[ctrl]->UPSCR[port] & HSUSBH_UPSCR_PE_Msk) == 0))
    {
        usbh_ehci_reg_ptr[ctrl]->UPSCR[port] |= HSUSBH_UPSCR_CSC_Msk;
        usbh_ehci_reg_ptr[ctrl]->UPSCR[port] |= HSUSBH_UPSCR_PO_Msk;
        return ARM_DRIVER_ERROR;
    }

    usbh_ehci_reg_ptr[ctrl]->UPSCR[port] |= HSUSBH_UPSCR_PEC_Msk;

    signal_port_event[ctrl](port, ARM_USBH_EVENT_RESET);

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PortReset(uint8_t port)
{
    return USBH_HW_PortReset(0, port);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PortReset(uint8_t port)
{
    return USBH_HW_PortReset(1, port);
}
#endif

/**
  \fn          int32_t USBH_HW_PortSuspend (uint8_t ctrl, uint8_t port)
  \brief       Suspend Root HUB Port (stop generating SOFs).
  \param[in]   ctrl  Index of USB Host controller
  \param[in]   port  Root HUB Port Number
  \return      \ref execution_status
*/
static int32_t USBH_HW_PortSuspend(uint8_t ctrl, uint8_t port)
{

    if ((usbh_driver_capabilities[ctrl].port_mask & (1UL << port)) == 0U)
    {
        // If port is not available
        return ARM_DRIVER_ERROR;
    }

    usbh_ehci_reg_ptr[ctrl]->UPSCR[port] |= HSUSBH_UPSCR_SUSPEND_Msk; // Set Suspend
    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PortSuspend(uint8_t port)
{
    return USBH_HW_PortSuspend(0, port);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PortSuspend(uint8_t port)
{
    return USBH_HW_PortSuspend(1, port);
}
#endif

/**
  \fn          int32_t USBH_HW_PortResume (uint8_t ctrl, uint8_t port)
  \brief       Resume Root HUB Port (start generating SOFs).
  \param[in]   ctrl  Index of USB Host controller
  \param[in]   port  Root HUB Port Number
  \return      \ref execution_status
*/
static int32_t USBH_HW_PortResume(uint8_t ctrl, uint8_t port)
{

    if ((usbh_driver_capabilities[ctrl].port_mask & (1UL << port)) == 0U)
    {
        // If port is not available
        return ARM_DRIVER_ERROR;
    }

    usbh_ehci_reg_ptr[ctrl]->UPSCR[port] |= HSUSBH_UPSCR_FPR_Msk;  // Force Port Resume
    (void)delay_ms(20U); //wait 20ms
    usbh_ehci_reg_ptr[ctrl]->UPSCR[port] &= ~HSUSBH_UPSCR_FPR_Msk;  // Clear Force Port Resume
    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PortResume(uint8_t port)
{
    return USBH_HW_PortResume(0, port);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PortResume(uint8_t port)
{
    return USBH_HW_PortResume(1, port);
}
#endif

/**
  \fn          ARM_USBH_PORT_STATE USBH_HW_PortGetState (uint8_t ctrl, uint8_t port)
  \brief       Get current Root HUB Port State.
  \param[in]   ctrl  Index of USB Host controller
  \param[in]   port  Root HUB Port Number
  \return      Port State \ref ARM_USBH_PORT_STATE
*/
static ARM_USBH_PORT_STATE USBH_HW_PortGetState(uint8_t ctrl, uint8_t port)
{
    ARM_USBH_PORT_STATE port_state = { 0U, 0U, 0U, 0U };
    uint32_t            PORTSC_val;

    if ((usbh_driver_capabilities[ctrl].port_mask & (1UL << port)) == 0U)
    {
        // If port is not available
        return port_state;
    }

    PORTSC_val  = usbh_ehci_reg_ptr[ctrl]->UPSCR[port];

    if ((PORTSC_val & HSUSBH_UPSCR_CCS_Msk) != 0U)
    {
        port_state.connected = 1U;
    }
    else
    {
        port_state.connected = 0U;
    }

    if ((PORTSC_val & HSUSBH_UPSCR_OCA_Msk) != 0U)
    {
        port_state.overcurrent = 1U;
    }
    else
    {
        port_state.overcurrent = 0U;
    }

    // need to modify
#if 0

    // need to do
    switch ((PORTSC_val & USBH_EHCI_PORTSC_PSPD_MSK) >> 26)
    {
        case 1:                             // Low-speed
            port_state.speed = ARM_USB_SPEED_LOW;
            break;

        case 0:                             // Full-speed
            port_state.speed = ARM_USB_SPEED_FULL;
            break;

        case 2:                             // High-speed
            port_state.speed = ARM_USB_SPEED_HIGH;
            break;

        default:
            port_state.speed = ARM_USB_SPEED_LOW;
            break;
    }

#else
    port_state.speed = ARM_USB_SPEED_HIGH;
#endif
    return port_state;
}
static ARM_USBH_PORT_STATE USBH0_HW_PortGetState(uint8_t port)
{
    return USBH_HW_PortGetState(0, port);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static ARM_USBH_PORT_STATE USBH1_HW_PortGetState(uint8_t port)
{
    return USBH_HW_PortGetState(1, port);
}
#endif

/**
  \fn          ARM_USBH_PIPE_HANDLE USBH_HW_PipeCreate (uint8_t  ctrl,
                                                        uint8_t  dev_addr,
                                                        uint8_t  dev_speed,
                                                        uint8_t  hub_addr,
                                                        uint8_t  hub_port,
                                                        uint8_t  ep_addr,
                                                        uint8_t  ep_type,
                                                        uint16_t ep_max_packet_size,
                                                        uint8_t  ep_interval)
  \brief       Create Pipe in System.
  \param[in]   ctrl       Index of USB Host controller
  \param[in]   dev_addr   Device Address
  \param[in]   dev_speed  Device Speed
  \param[in]   hub_addr   Hub Address
  \param[in]   hub_port   Hub Port
  \param[in]   ep_addr    Endpoint Address
                - ep_addr.0..3: Address
                - ep_addr.7:    Direction
  \param[in]   ep_type    Endpoint Type (ARM_USB_ENDPOINT_xxx)
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \param[in]   ep_interval        Endpoint Polling Interval
  \return      Pipe Handle \ref ARM_USBH_PIPE_HANDLE
*/
static ARM_USBH_PIPE_HANDLE USBH_HW_PipeCreate(uint8_t ctrl, uint8_t dev_addr, uint8_t dev_speed, uint8_t hub_addr, uint8_t hub_port, uint8_t ep_addr, uint8_t ep_type, uint16_t ep_max_packet_size,
                                               uint8_t ep_interval)
{
    USBH_EHCI_qH        *ptr_qH;
    USBH_EHCI_qH        *ptr_first_qH;
    USBH_EHCI_qH        *ptr_last_qH;
    USBH_EHCI_qTD       *ptr_qTD;
    USBH_EHCI_siTD      *ptr_siTD;
    USBH_EHCI_siTD      *ptr_siTD1;
    USBH_TransferInfo_t *ptr_TI;
    uint32_t             addr;
    uint8_t              restart_flags;

