OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    (void)hub_addr;
    (void)hub_port;

    switch (ep_type)                              // Check Endpoint Type is valid
    {
        case ARM_USB_ENDPOINT_CONTROL:
        case ARM_USB_ENDPOINT_BULK:
        case ARM_USB_ENDPOINT_INTERRUPT:
        case ARM_USB_ENDPOINT_ISOCHRONOUS:
            break;

        default:                                    // Unknown endpoint type
            return 0U;
    }

    if (ep_type != ARM_USB_ENDPOINT_ISOCHRONOUS)  // If Control, Bulk or Interrupt pipe
    {

        // Get free qH and TI
        ptr_qH  = USBH_EHCI_qH_GetFree(ctrl);

        if (ptr_qH  == NULL)
        {
            return 0U;
        }

        ptr_qTD = USBH_EHCI_qTD_GetFree(ctrl);

        if (ptr_qTD == NULL)
        {
            return 0U;
        }

        ptr_TI  = USBH_EHCI_TI_GetFree(ctrl);

        if (ptr_TI  == NULL)
        {
            return 0U;
        }

        memset(ptr_TI, 0, sizeof(USBH_TransferInfo_t));

        restart_flags = 0;

        switch (ep_type)                              // Endpoint Type
        {
            case ARM_USB_ENDPOINT_CONTROL:
            case ARM_USB_ENDPOINT_BULK:
                (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED,    false);
                restart_flags |= 1U;
                break;

            case ARM_USB_ENDPOINT_INTERRUPT:
                (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, false);
                restart_flags |= (1U << 1);
                break;

            default:                                    // Unknown endpoint type
                return 0U;
        }

        // Fill in all fields from Endpoint Descriptor to internal element (qH)
        ptr_qH->DW1.MaxPcktLen = ep_max_packet_size;

        switch (dev_speed)
        {
            case ARM_USB_SPEED_LOW:
                ptr_qH->DW1.EPS = 1U;
                break;

            case ARM_USB_SPEED_FULL:
                ptr_qH->DW1.EPS = 0U;
                break;

            case ARM_USB_SPEED_HIGH:
                ptr_qH->DW1.EPS = 2U;
                break;

            default:                                  // Unknown speed
                return 0U;
        }

        ptr_qH->DW1.EndPt   = ep_addr  & 0x0FU;     // Endpoint Number
        ptr_qH->DW1.DevAddr = dev_addr & 0x7FU;     // Device Address

        ptr_qH->DW2.Mult    = 1U;                   // Pipe Multiplier = 1

        switch (ep_type)                            // Endpoint Type
        {
            case ARM_USB_ENDPOINT_CONTROL:
                ptr_qH->DW1.RL  = 15U;                  // NAK Count Reload = 15
                ptr_qH->DW1.C   = 1U;                   // Control Endpoint Flag
                break;

            case ARM_USB_ENDPOINT_BULK:
                ptr_qH->DW1.RL  = 15U;                  // NAK Count Reload = 15
                break;

            case ARM_USB_ENDPOINT_INTERRUPT:
                ptr_qH->DW1.RL  = 1U;                   // NAK Count Reload = 1
                ptr_qH->DW2.ISM = 1U;                   // Interrupt Schedule Mask Flag
                break;

            default:                                  // Unknown endpoint type
                return 0U;
        }

        ptr_qH->DW4.T = 1U;                         // Set Next qTD T bit to 1
        ptr_qH->DW5.T = 1U;                         // Set Alternate Next qTD T bit to 1

        // Get previous qH that should be linked to this one or if this is the only
        // qH in the list link it to itself
        switch (ep_type)                            // Endpoint Type
        {
            case ARM_USB_ENDPOINT_CONTROL:
            case ARM_USB_ENDPOINT_BULK:
                addr         = usbh_ehci_reg_ptr[ctrl]->UCALAR & ~0x1FU;
                ptr_first_qH = (USBH_EHCI_qH *)addr;

                if (!ptr_first_qH)                      // If this is first qH
                {
                    ptr_qH->DW1.H            =  1U;       // Set Head of Reclamation List (H)
                    ptr_qH->DW0.HorizLinkPtr = (uint32_t)ptr_qH >> 5;
                    ptr_qH->DW0.Typ          =  1U;       // Typ = QH
                    ptr_qH->DW0.T            =  0U;       // T   = 0
                    usbh_ehci_reg_ptr[ctrl]->UCALAR = (uint32_t)ptr_qH & ~0x1FU;
                }
                else                                    // If this is not first qH
                {
                    ptr_last_qH              =  USBH_EHCI_qH_GetLast(ptr_first_qH);
                    ptr_qH->DW0.HorizLinkPtr = (uint32_t)ptr_first_qH >> 5;
                    ptr_qH->DW0.Typ          =  1U;       // Typ = QH
                    ptr_qH->DW0.T            =  0U;       // T   = 0
                    ptr_last_qH->DW0.HorizLinkPtr = (uint32_t)ptr_qH >> 5;
                    ptr_last_qH->DW0.Typ     =  1U;       // Typ = QH
                    ptr_last_qH->DW0.T       =  0U;       // T   = 0
                }

                break;

            case ARM_USB_ENDPOINT_INTERRUPT:
                ptr_qH->DW0.Typ            =  1U;       // Typ = QH
                ptr_qH->DW0.T              =  1U;
                (void)USBH_EHCI_qH_SetIntEntries(ctrl, ptr_qH, dev_speed, ep_interval);
                break;

            default:                                  // Unknown endpoint type
                return 0U;
        }

        ptr_qTD->DW0.T = 1U;                        // Set Next qTD T bit to 1
        ptr_qTD->DW1.T = 1U;                        // Set Alternate Next qTD T bit to 1
        ptr_qTD->DW2.IOC = 1U;                      // Set IOC to 1, it denotes qTD as used

        ptr_TI->ptr_transfer = (uint32_t *)((uint32_t)ptr_qTD);
        ptr_TI->ptr_pipe     = (uint32_t *)((uint32_t)ptr_qH);

        if (((usbh_ehci_reg_ptr[ctrl]->UCMDR & (1UL << 5)) == 0U) && ((restart_flags & 1U) != 0U))
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED,    true);
        }

        if (((usbh_ehci_reg_ptr[ctrl]->UCMDR & (1UL << 4)) == 0U) && ((restart_flags & 2U) != 0U))
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, true);
        }

