OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
        return ((ARM_USBH_PIPE_HANDLE)(ptr_qH));
    }
    else                                          // If Isochronous pipe
    {

        if (dev_speed == ARM_USB_SPEED_HIGH)        // High-speed isochronous
        {
            // High-speed isochronous pipe not supported
            return 0U;
        }

        // Endpoint interval must be in limits 1..16
        if ((ep_interval < 1U) || (ep_interval > 16U))
        {
            return 0U;
        }

        // Get free TI (Transfer Info)
        ptr_TI = USBH_EHCI_TI_GetFree(ctrl);

        if (ptr_TI == NULL)
        {
            return 0U;
        }

        memset(ptr_TI, 0, sizeof(USBH_TransferInfo_t));

        // Store interval
        ptr_TI->iso_interval = (uint16_t)(1U << (ep_interval - 1U));

        if (ptr_TI->iso_interval > (pfl_size[ctrl] / 2))
        {
            // Iso interval cannot be longer than size of PFL / 2
            ptr_TI->iso_interval = (uint16_t)(pfl_size[ctrl] / 2);
        }

        // Store max packet size
        ptr_TI->iso_max_transfer_size = ep_max_packet_size;

        // Get 2 free siTDs (double buffering)
        ptr_siTD  = (USBH_EHCI_siTD *)USBH_EHCI_PE_GetFree(ctrl, USBH_EHCI_ELEMENT_TYPE_siTD);

        if (ptr_siTD == NULL)
        {
            return 0U;
        }

        ptr_siTD->DW1.DevAddr = dev_addr & 0x7FU; // Device Address

        ptr_siTD1 = (USBH_EHCI_siTD *)USBH_EHCI_PE_GetFree(ctrl, USBH_EHCI_ELEMENT_TYPE_siTD);

        if (ptr_siTD1 == NULL)
        {
            return 0U;
        }

        ptr_siTD->DW0.Typ = 2U;                   // Typ = siTD
        ptr_siTD->DW0.T   = 1U;                   // Link to next is invalid

        ptr_siTD->DW1.IO  = (ep_addr >> 7) & 1U;  // Direction
        ptr_siTD->DW1.EndPt = ep_addr  & 0x0FU;   // Endpoint Number

        ptr_siTD->DW2.SCM = 1U;                   // uFrame C-mask
        ptr_siTD->DW2.SSM = 1U;                   // uFrame S-mask

        // Copy all settings from first siTD to second siTD
        memcpy(ptr_siTD1, ptr_siTD, sizeof(USBH_EHCI_siTD));

        ptr_TI->ptr_pipe      = (uint32_t *)((uint32_t)ptr_siTD);
        ptr_TI->iso_ptr_pipe1 = (uint32_t *)((uint32_t)ptr_siTD1);

        (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, true);

        return ((ARM_USBH_PIPE_HANDLE)(ptr_siTD));
    }
}
static ARM_USBH_PIPE_HANDLE USBH0_HW_PipeCreate(uint8_t dev_addr, uint8_t dev_speed, uint8_t hub_addr, uint8_t hub_port, uint8_t ep_addr, uint8_t ep_type, uint16_t ep_max_packet_size,
                                                uint8_t  ep_interval)
{
    return USBH_HW_PipeCreate(0, dev_addr, dev_speed, hub_addr, hub_port, ep_addr, ep_type, ep_max_packet_size, ep_interval);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static ARM_USBH_PIPE_HANDLE USBH1_HW_PipeCreate(uint8_t dev_addr, uint8_t dev_speed, uint8_t hub_addr, uint8_t hub_port, uint8_t ep_addr, uint8_t ep_type, uint16_t ep_max_packet_size,
                                                uint8_t  ep_interval)
{
    return USBH_HW_PipeCreate(1, dev_addr, dev_speed, hub_addr, hub_port, ep_addr, ep_type, ep_max_packet_size, ep_interval);
}
#endif

/**
  \fn          int32_t USBH_HW_PipeModify (uint8_t              ctrl,
                                           ARM_USBH_PIPE_HANDLE pipe_hndl,
                                           uint8_t              dev_addr,
                                           uint8_t              dev_speed,
                                           uint8_t              hub_addr,
                                           uint8_t              hub_port,
                                           uint16_t             ep_max_packet_size)
  \brief       Modify Pipe in System.
  \param[in]   ctrl       Index of USB Host controller
  \param[in]   pipe_hndl  Pipe Handle
  \param[in]   dev_addr   Device Address
  \param[in]   dev_speed  Device Speed
  \param[in]   hub_addr   Hub Address
  \param[in]   hub_port   Hub Port
  \param[in]   ep_max_packet_size Endpoint Maximum Packet Size
  \return      \ref execution_status
*/
static int32_t USBH_HW_PipeModify(uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl, uint8_t dev_addr, uint8_t dev_speed, uint8_t hub_addr, uint8_t hub_port, uint16_t ep_max_packet_size)
{
    USBH_EHCI_qH *ptr_qH;

    (void)hub_addr;
    (void)hub_port;

    if (pipe_hndl == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (((USBH_EHCI_COMMON *)pipe_hndl)->DW0.Typ != USBH_EHCI_ELEMENT_TYPE_qH)
    {
        // Not supported for isochronous pipe
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    ptr_qH = (USBH_EHCI_qH *)(pipe_hndl);

    if (ptr_qH->DW2.ISM != 0U)
    {
        // Interrupt Endpoint type
        (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, false);
    }
    else
    {
        // Control or Bulk Endpoint type
        (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED,    false);
    }

    // Update only device address, device speed and maximum packet size
    ptr_qH->DW1.MaxPcktLen = ep_max_packet_size;

    switch (dev_speed)
    {
        case ARM_USB_SPEED_LOW:
            ptr_qH->DW1.EPS = 1U;
            break;

        case ARM_USB_SPEED_FULL:
            ptr_qH->DW1.EPS = 0U;
            break;

        case ARM_USB_SPEED_HIGH:
            ptr_qH->DW1.EPS = 2U;
            break;

        default:                                    // Unknown endpoint type
            return ARM_DRIVER_ERROR_PARAMETER;
    }

    ptr_qH->DW1.DevAddr = dev_addr & 0x7FU;       // Device Address

    if (ptr_qH->DW2.ISM != 0U)
    {
        // Interrupt Endpoint type
        (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, true);
    }
    else
    {
        // Control or Bulk Endpoint type
        (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED, true);
    }

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PipeModify(ARM_USBH_PIPE_HANDLE pipe_hndl, uint8_t dev_addr, uint8_t dev_speed, uint8_t hub_addr, uint8_t hub_port, uint16_t ep_max_packet_size)
{
    return USBH_HW_PipeModify(0, pipe_hndl, dev_addr, dev_speed, hub_addr, hub_port, ep_max_packet_size);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PipeModify(ARM_USBH_PIPE_HANDLE pipe_hndl, uint8_t dev_addr, uint8_t dev_speed, uint8_t hub_addr, uint8_t hub_port, uint16_t ep_max_packet_size)
{
    return USBH_HW_PipeModify(1, pipe_hndl, dev_addr, dev_speed, hub_addr, hub_port, ep_max_packet_size);
}
#endif

/**
  \fn          int32_t USBH_HW_PipeTransferAbort (uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
  \brief       Abort current USB Pipe transfer.
  \param[in]   ctrl       Index of USB Host controller
  \param[in]   pipe_hndl  Pipe Handle
  \return      \ref execution_status
*/
static int32_t USBH_HW_PipeTransferAbort(uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    USBH_EHCI_qH        *ptr_qH;
    USBH_TransferInfo_t *ptr_TI;

    if (pipe_hndl == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (((USBH_EHCI_COMMON *)pipe_hndl)->DW0.Typ == USBH_EHCI_ELEMENT_TYPE_qH)
    {
        // If Control, Bulk or Interrupt pipe

        ptr_qH = (USBH_EHCI_qH *)pipe_hndl;

        ptr_TI = USBH_EHCI_TI_Find_qH(ctrl, ptr_qH);

        if (ptr_TI == NULL)
        {
            return ARM_DRIVER_OK;
        }

        if (ptr_TI->active == 0U)
        {
            return ARM_DRIVER_OK;    // If transfer is not active
        }

        if (!USBH_EHCI_qTD_Dequeue(ctrl, ptr_qH, (USBH_EHCI_qTD *)((uint32_t)ptr_TI->ptr_transfer)))
        {
            return ARM_DRIVER_ERROR;
        }
    }
    else
    {

