OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
        // For Isochronous pipe
        ptr_TI = USBH_EHCI_TI_Find_PE(ctrl, (void *)pipe_hndl);

        if (ptr_TI == NULL)
        {
            return ARM_DRIVER_ERROR;
        }

        if (ptr_TI->active == 0U)
        {
            return ARM_DRIVER_OK;    // If transfer is not active
        }

        (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, false);

        // Remove isochronous TD (siTDs)
        if (ptr_TI->iso_ptr_pipe1 != NULL)
        {
            (void)USBH_EHCI_PFL_PE_Remove(ctrl, (void *)ptr_TI->iso_ptr_pipe1);
            ptr_TI->iso_data1 = NULL;
        }

        if (ptr_TI->ptr_pipe != NULL)
        {
            (void)USBH_EHCI_PFL_PE_Remove(ctrl, (void *)ptr_TI->ptr_pipe);
            ptr_TI->data = NULL;
        }

        (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, true);
    }

    ptr_TI->active = 0U;

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PipeTransferAbort(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeTransferAbort(0, pipe_hndl);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PipeTransferAbort(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeTransferAbort(1, pipe_hndl);
}
#endif

/**
  \fn          int32_t USBH_HW_PipeDelete (uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
  \brief       Delete Pipe from System.
  \param[in]   ctrl       Index of USB Host controller
  \param[in]   pipe_hndl  Pipe Handle
  \return      \ref execution_status
*/
static int32_t USBH_HW_PipeDelete(uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    USBH_EHCI_qH        *ptr_qH;
    USBH_EHCI_qH        *ptr_prev_qH;
    USBH_TransferInfo_t *ptr_TI;
    const uint32_t            *ptr_uint32_t;
    uint32_t             cnt;
    uint8_t              restart_flags;

    if (pipe_hndl == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (((USBH_EHCI_COMMON *)pipe_hndl)->DW0.Typ == USBH_EHCI_ELEMENT_TYPE_qH)
    {
        // For Control, Bulk and Interrupt pipe

        ptr_qH = (USBH_EHCI_qH *)pipe_hndl;
        ptr_TI = USBH_EHCI_TI_Find_qH(ctrl, ptr_qH);

        if (ptr_TI == NULL)
        {
            return ARM_DRIVER_ERROR;
        }

        if (ptr_TI->active != 0U)
        {
            return ARM_DRIVER_ERROR_BUSY;
        }

        if (ptr_qH->DW2.ISM != 0U)
        {
            // Interrupt Endpoint type
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, false);
        }
        else
        {
            // Control or Bulk Endpoint type
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED,    false);
        }

        // If next queue Head Pointer points to the queue Head that is being
        // processed if so set next queue Head Pointer to the queue Head
        // Horizontal Link Pointer
        restart_flags = 0;

        if (ptr_qH->DW2.ISM != 0U)
        {
            // Interrupt Endpoint
            (void)USBH_EHCI_qH_ClearIntEntries(ctrl, ptr_qH);

            ptr_uint32_t = (usbh_ehci_ptr[ctrl])->ptr_PFL;
            cnt = USBH_EHCI_PFL_GetSize(ctrl);

            while (cnt != 0U)
            {
                cnt--;

                if ((*ptr_uint32_t & 1U) == 0U)
                {
                    restart_flags |= (1U << 1);
                    break;
                }

                ptr_uint32_t++;
            }
        }
        else
        {
            // Control or Bulk Endpoint
            if (((uint32_t)usbh_ehci_reg_ptr[ctrl]->UCALAR & ~0x1FU) == ((uint32_t)ptr_qH & ~0x1FU))
            {
                if (((uint32_t)ptr_qH->DW0.HorizLinkPtr << 5) == ((uint32_t)ptr_qH & ~0x1FU))   // If only 1
                {
                    usbh_ehci_reg_ptr[ctrl]->UCALAR = 0;
                }
                else
                {
                    // Point to next
                    usbh_ehci_reg_ptr[ctrl]->UCALAR = (uint32_t)ptr_qH->DW0.HorizLinkPtr << 5;
                    ptr_qH->DW1.H  = 1;
                    restart_flags |=  1U;
                }
            }
        }

        // If previous qH exists link it to next qH
        ptr_prev_qH = USBH_EHCI_qH_GetPrevious(ctrl, ptr_qH);

        if (ptr_prev_qH != NULL)
        {
            ptr_prev_qH->DW0 = ptr_qH->DW0;
        }

        (void)USBH_EHCI_qTD_Clear((USBH_EHCI_qTD *)ptr_TI->ptr_transfer);   // Clear qTD
        (void)USBH_EHCI_qH_Clear(ptr_qH);     // Clear queue Head

        if ((restart_flags & 1U) != 0U)
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_ASYNC_SCHED,    true);
        }

        if ((restart_flags & 2U) != 0U)
        {
            (void)USBH_EHCI_StartStop(ctrl, USBH_EHCI_PERIODIC_SCHED, true);
        }
    }
    else
    {
        // For Isochronous pipe
        USBH_HW_PipeTransferAbort(ctrl, pipe_hndl);

        ptr_TI = USBH_EHCI_TI_Find_PE(ctrl, (void *)pipe_hndl);

        if (ptr_TI == NULL)
        {
            return ARM_DRIVER_ERROR;
        }

        (void)USBH_EHCI_PE_Clear((void *)ptr_TI->ptr_pipe);
        (void)USBH_EHCI_PE_Clear((void *)ptr_TI->iso_ptr_pipe1);
    }

    memset(ptr_TI, 0, sizeof(USBH_TransferInfo_t));

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PipeDelete(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeDelete(0, pipe_hndl);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PipeDelete(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeDelete(1, pipe_hndl);
}
#endif

/**
  \fn          int32_t USBH_HW_PipeReset (uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
  \brief       Reset Pipe.
  \param[in]   ctrl       Index of USB Host controller
  \param[in]   pipe_hndl  Pipe Handle
  \return      \ref execution_status
*/
static int32_t USBH_HW_PipeReset(uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
{

    (void)ctrl;

    if (pipe_hndl == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

    if (((USBH_EHCI_COMMON *)pipe_hndl)->DW0.Typ != USBH_EHCI_ELEMENT_TYPE_qH)
    {
        // Not supported for isochronous pipe
        return ARM_DRIVER_ERROR_UNSUPPORTED;
    }

    ((USBH_EHCI_qH *)pipe_hndl)->DW6.DT = 0U;     // Reset data toggle bit to 0

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PipeReset(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeReset(0, pipe_hndl);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PipeReset(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeReset(1, pipe_hndl);
}
#endif

/**
  \fn          int32_t USBH_HW_PipeTransfer (uint8_t              ctrl,
                                             ARM_USBH_PIPE_HANDLE pipe_hndl,
                                             uint32_t             packet,
                                             uint8_t             *data,
                                             uint32_t             num)
  \brief       Transfer packets through USB Pipe.
  \param[in]   ctrl       Index of USB Host controller
  \param[in]   pipe_hndl  Pipe Handle
  \param[in]   packet     Packet information
  \param[in]   data       Pointer to buffer with data to send or for data to receive
  \param[in]   num        Number of data bytes to transfer
  \return      \ref execution_status
*/
static int32_t USBH_HW_PipeTransfer(uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl, uint32_t packet, uint8_t *data, uint32_t num)
{
    USBH_EHCI_COMMON    *ptr_curr;
    USBH_EHCI_qTD       *ptr_qTD;
    USBH_TransferInfo_t *ptr_TI;
    uint32_t             num_to_transfer;



    if (pipe_hndl == 0U)
    {
        return ARM_DRIVER_ERROR;
    }

