OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
    ptr_TI   = USBH_EHCI_TI_Find_PE(ctrl, (USBH_EHCI_qH *)pipe_hndl);

    if (ptr_TI  == NULL)
    {
        return ARM_DRIVER_ERROR;
    }

    ptr_curr = (USBH_EHCI_COMMON *)pipe_hndl;

    if (ptr_curr->DW0.Typ == USBH_EHCI_ELEMENT_TYPE_qH)      // If Control, Bulk or Interrupt pipe
    {

        if (ptr_TI->active != 0U)
        {
            return ARM_DRIVER_ERROR_BUSY;
        }

        ptr_qTD = (USBH_EHCI_qTD *)ptr_TI->ptr_transfer;

        if (ptr_qTD == NULL)
        {
            return ARM_DRIVER_ERROR;
        }

        ptr_TI->packet                = packet;
        ptr_TI->data                  = data;
        ptr_TI->num                   = num;
        ptr_TI->num_transferred_total = 0;

        if (num >= 16384U)
        {
            ptr_TI->num_to_transfer     = 16384U;
        }
        else
        {
            ptr_TI->num_to_transfer     = num;
        }

#if 0

        // LED indicator IND0 control
        if ((((USBH_EHCI_qH *)((uint32_t)ptr_TI->ptr_pipe))->DW2.ISM) == 0U)
        {
            for (j = 0U; j < 15U; j++)
            {
                if ((port_act[ctrl] & (1UL << j)) != 0U)
                {
                    usbh_ehci_reg_ptr[ctrl]->[j] |=  USBH_EHCI_PORTSC_PIC(1);   // Activate IND0
                }
            }
        }

#endif

        if (!USBH_EHCI_qTD_Enqueue(ctrl, ptr_TI, (USBH_EHCI_qH *)pipe_hndl, ptr_qTD, packet, data, ptr_TI->num_to_transfer))
        {
            return ARM_DRIVER_ERROR;
        }
    }
    else                                          // If Isochronous pipe
    {

        if (num >= ptr_TI->iso_max_transfer_size)
        {
            num_to_transfer = ptr_TI->iso_max_transfer_size;
        }
        else
        {
            num_to_transfer = num;
        }

        if ((ptr_TI->data == NULL) && (ptr_TI->ptr_pipe != NULL))                   // If first transfer element is free
        {
            ptr_TI->data = data;

            if (!USBH_EHCI_IsoTransferActivate(ctrl, ptr_TI, (void *)pipe_hndl, data, num_to_transfer))
            {
                ptr_TI->data = NULL;
                return ARM_DRIVER_ERROR;
            }
        }
        else if ((ptr_TI->iso_data1 == NULL) && (ptr_TI->iso_ptr_pipe1 != NULL))    // If second transfer element is free
        {
            ptr_TI->iso_data1 = data;

            if (!USBH_EHCI_IsoTransferActivate(ctrl, ptr_TI, (void *)ptr_TI->iso_ptr_pipe1, data, num_to_transfer))
            {
                ptr_TI->iso_data1 = NULL;
                return ARM_DRIVER_ERROR;
            }
        }
        else
        {
            return ARM_DRIVER_ERROR_BUSY;
        }
    }

    return ARM_DRIVER_OK;
}
static int32_t USBH0_HW_PipeTransfer(ARM_USBH_PIPE_HANDLE pipe_hndl, uint32_t packet, uint8_t *data, uint32_t num)
{
    return USBH_HW_PipeTransfer(0, pipe_hndl, packet, data, num);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static int32_t USBH1_HW_PipeTransfer(ARM_USBH_PIPE_HANDLE pipe_hndl, uint32_t packet, uint8_t *data, uint32_t num)
{
    return USBH_HW_PipeTransfer(1, pipe_hndl, packet, data, num);
}
#endif

/**
  \fn          uint32_t USBH_HW_PipeTransferGetResult (uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
  \brief       Get result of USB Pipe transfer.
  \param[in]   ctrl       Index of USB Host controller
  \param[in]   pipe_hndl  Pipe Handle
  \return      number of successfully transferred data bytes
*/
static uint32_t USBH_HW_PipeTransferGetResult(uint8_t ctrl, ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    const USBH_TransferInfo_t *ptr_TI;

    if (pipe_hndl == 0U)
    {
        return 0U;
    }

    if (((USBH_EHCI_COMMON *)pipe_hndl)->DW0.Typ != USBH_EHCI_ELEMENT_TYPE_qH)
    {
        // Not supported for isochronous pipe
        return 0U;
    }

    ptr_TI = USBH_EHCI_TI_Find_qH(ctrl, (USBH_EHCI_qH *)pipe_hndl);

    if (ptr_TI == NULL)
    {
        return 0U;
    }

    return (ptr_TI->num_transferred_total);
}
static uint32_t USBH0_HW_PipeTransferGetResult(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeTransferGetResult(0, pipe_hndl);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static uint32_t USBH1_HW_PipeTransferGetResult(ARM_USBH_PIPE_HANDLE pipe_hndl)
{
    return USBH_HW_PipeTransferGetResult(1, pipe_hndl);
}
#endif

/**
  \fn          uint16_t USBH_HW_GetFrameNumber (uint8_t ctrl)
  \brief       Get current USB Frame Number.
  \param[in]   ctrl     Index of USB Host controller
  \return      Frame Number
*/
static uint16_t USBH_HW_GetFrameNumber(uint8_t ctrl)
{

    return ((uint16_t)(usbh_ehci_reg_ptr[ctrl]->UFINDR >> 3));
}
static uint16_t USBH0_HW_GetFrameNumber(void)
{
    return USBH_HW_GetFrameNumber(0);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static uint16_t USBH1_HW_GetFrameNumber(void)
{
    return USBH_HW_GetFrameNumber(1);
}
#endif

/// \brief         Interrupt handling routine
/// \param[in]     ctrl          index of USB Host controller
static void USBH_HW_IRQ_Handler(uint8_t ctrl)
{
    ARM_USBH_PIPE_HANDLE  pipe_handle;
    USBH_EHCI_qTD        *ptr_qTD;
    USBH_EHCI_siTD       *ptr_siTD;
    USBH_TransferInfo_t  *ptr_TI;
    USBH_PipeEventInfo_t *ptr_PEI;
    uint32_t              usbsts;
    uint32_t              usbintr;
    uint32_t              frindex;
    uint32_t              done_pfl_index;
    uint32_t              portsc;
    uint32_t              status;
    uint32_t              ep_event;
    uint32_t              transferred;
    uint32_t             *ptr_uint32_t;
    uint32_t              dw0;
    const uint8_t        *buf;
    uint8_t               i;

    // Read all registers for interrupt handling
    usbsts  = usbh_ehci_reg_ptr[ctrl]->USTSR;
    usbh_ehci_reg_ptr[ctrl]->USTSR = usbsts;
    usbintr = usbh_ehci_reg_ptr[ctrl]->UIENR;
    frindex = usbh_ehci_reg_ptr[ctrl]->UFINDR;

    // Analyze interrupt
    if ((usbsts & usbintr) != 0U)         // Check if not spurious Interrupt
    {
        if ((usbsts & HSUSBH_USTSR_PCD_Msk) != 0U)
        {
            // Port Change Detect
            for (i = 0U; i < USBH_EHCI_PORT; i ++)       // Go through all ports
            {
                if ((usbh_driver_capabilities[ctrl].port_mask & (1UL << i)) != 0U)
                {
                    // If port is enabled
                    portsc = usbh_ehci_reg_ptr[ctrl]->UPSCR[i];
                    usbh_ehci_reg_ptr[ctrl]->UPSCR[i] = portsc;

                    if ((portsc & HSUSBH_UPSCR_OCC_Msk) != 0U)
                    {
                        // Over-current Change
                        // Clear Connect Status Change
                        if ((portsc & HSUSBH_UPSCR_OCA_Msk) != 0U)
                        {
                            //              USBH_HW_PortVbusOnOff (ctrl, i, false);
                            //              signal_port_event[ctrl](i, ARM_USBH_EVENT_OVERCURRENT);
                        }
                    }

                    if ((portsc & HSUSBH_UPSCR_CSC_Msk) != 0U)
                    {
                        // Connect Status Change
                        // Clear Connect Status Change
                        if ((portsc & HSUSBH_UPSCR_CCS_Msk) != 0U)
                        {
                            // Device Connected
                            port_act[ctrl] |= (1UL << i);
                            //usbh_ehci_reg_ptr[ctrl]->PORTSC[i] |= USBH_EHCI_PORTSC_PIC(2);    // Activate IND1
                            signal_port_event[ctrl](i, ARM_USBH_EVENT_CONNECT);
                        }
                        else
                        {
                            // Device Disconnected
                            port_act[ctrl] &= ~(1UL << i);
                            //usbh_ehci_reg_ptr[ctrl]->PORTSC[i] &= ~USBH_EHCI_PORTSC_PIC_MSK;  // Deactivate LEDs
                            signal_port_event[ctrl](i, ARM_USBH_EVENT_DISCONNECT);
                        }
                    }

                    if ((portsc & HSUSBH_UPSCR_PE_Msk) != 0U)
                    {
                        // Port Enable is set
                        if ((portsc & HSUSBH_UPSCR_FPR_Msk) != 0U)
                        {
                            // Port Remote Wake-up
                            //not suuprot..
                            signal_port_event[ctrl](i, ARM_USBH_EVENT_REMOTE_WAKEUP);
                        }
                    }
                }
                else
                {
                    if ((usbh_driver_capabilities[ctrl].port_mask & ~((1UL << i) - 1U)) == 0U)
                    {
                        break;
                    }
                }
            }
        }

#if 1

        if ((usbsts & HSUSBH_USTSR_USBINT_Msk) != 0U)       // If USB Transaction Completed
        {
#if 1

