OpenNuvoton/M55M1BSP/Library/CMSIS/Driver/Source/Driver_USBH/Driver_USBH_EHCI/Source/Driver_USBH_EHCI.c
            // Process Isochronous transfers
            if ((usbh_ehci_ptr[ctrl])->ptr_siTD != NULL)
            {
                // Last processed Periodic Frame List entry is one before current frame index
                // Calculate previous PFL entry index
                done_pfl_index  = (frindex >> 3) - 2U;
                done_pfl_index &= pfl_size[ctrl] - 1;

                // PFL entry that was processed
                ptr_uint32_t = (uint32_t *)((usbh_ehci_ptr[ctrl])->ptr_PFL) + done_pfl_index;

                if ((*ptr_uint32_t != 1U) && (((*ptr_uint32_t >> 1U) & 3U) == USBH_EHCI_ELEMENT_TYPE_siTD))
                {
                    // If entry is valid and pointing to siTD
                    ptr_siTD = (USBH_EHCI_siTD *)(*ptr_uint32_t &(~0x1FU));

                    while (ptr_siTD != NULL)
                    {
                        ep_event = 0U;

                        // Process all chained siTDs
                        ptr_TI = USBH_EHCI_TI_Find_PE(ctrl, (void *)ptr_siTD);
                        buf = NULL;
                        transferred = 0U;
                        pipe_handle = 0U;

                        if (ptr_TI && ptr_TI->active)
                        {
                            if (ptr_TI->ptr_pipe == (uint32_t *)ptr_siTD)
                            {
                                // If first transfer is active
                                if ((ptr_TI->data != NULL) && (ptr_TI->iso_frame_index[0] == done_pfl_index))
                                {
                                    // If first transfer in TI has finished
                                    buf = ptr_TI->data;
                                    ptr_TI->data = NULL;
                                }
                            }
                            else if (ptr_TI->iso_ptr_pipe1 == (uint32_t *)ptr_siTD)
                            {
                                // If second transfer is active
                                if ((ptr_TI->iso_data1 != NULL) && (ptr_TI->iso_frame_index[1] == done_pfl_index))
                                {
                                    // If second transfer in TI has finished
                                    buf = ptr_TI->iso_data1;
                                    ptr_TI->iso_data1 = NULL;
                                }
                            }

                            if (buf != NULL)
                            {
                                // If data transfer has finished
                                pipe_handle = (ARM_USBH_PIPE_HANDLE)ptr_TI->ptr_pipe;

                                // Determine status of transfer
                                if ((ptr_siTD->DW3.Status & (3UL << 6)) == 0U)  // If no error
                                {
                                    ep_event = ARM_USBH_EVENT_TRANSFER_COMPLETE;
                                }
                                else                                            // If error
                                {
                                    ep_event = ARM_USBH_EVENT_BUS_ERROR;
                                }

                                // Calculate number of transferred data bytes
                                if (ptr_siTD->DW3.P != 0U)
                                {
                                    transferred = (uint32_t)((ptr_siTD->DW5.BufPtr << 12) + ptr_siTD->DW4.CurOfs) - (uint32_t)buf;
                                }
                                else
                                {
                                    transferred = (uint32_t)((ptr_siTD->DW4.BufPtr << 12) + ptr_siTD->DW4.CurOfs) - (uint32_t)buf;
                                }
                            }
                        }

                        // Progress to next siTD if available, and disable current
                        if (ptr_siTD->DW0.T == 0U)
                        {
                            // If there is next transfer descriptor linked to this one
                            dw0 = ((USBH_EHCI_siTD_DW *)ptr_siTD)->DW[0];
                            ptr_siTD->DW0.T = 1U;     // Terminate the current siTD
                            ptr_siTD = (USBH_EHCI_siTD *)(dw0 & (~0x1FU));

                            if (ptr_siTD->DW0.Typ != USBH_EHCI_ELEMENT_TYPE_siTD)
                            {
                                // If next linked transfer descriptor is not siTD then it can only be interrupt QH
                                // so we put it into PFL
                                *ptr_uint32_t = dw0;
                                ptr_siTD = NULL;       // Exit the loop
                            }

                            // If next linked transfer descriptor is siTD then we continue processing
                        }
                        else
                        {
                            // No next linked transfer descriptor
                            *ptr_uint32_t = 1U;       // Terminate PFL entry (T = 1)
                            ptr_siTD = NULL;         // Exit the loop
                        }

                        if (ep_event != 0U)
                        {
                            ptr_PEI = (usbh_ehci_ptr[ctrl])->ptr_PEI;
                            ptr_PEI->buf = buf;
                            ptr_PEI->len = transferred;
                            ep_event |= (uint32_t)(ptr_PEI);
                            signal_pipe_event[ctrl](pipe_handle, ep_event); // Signal Pipe Event
                        }
                    }
                }
            }

#endif
            // Process Bulk, Control and Interrupt transfers
            ptr_qTD = (USBH_EHCI_qTD *)((uint32_t)(usbh_ehci_ptr[ctrl])->ptr_qTD);

            if (ptr_qTD == NULL)
            {
                return;
            }

            for (i = 0U; i < (usbh_ehci_ptr[ctrl])->max_qTD; i++)
            {
                if ((ptr_qTD->DW2.Status & (1UL << 7)) != 0U)           // If qTD status is Active
                {
                    ptr_qTD++;
                    continue;
                }

                ptr_TI   = USBH_EHCI_TI_Find_qTD(ctrl, ptr_qTD);
                ep_event = 0;

                if (ptr_TI && ptr_TI->active)
                {
                    pipe_handle = (ARM_USBH_PIPE_HANDLE)ptr_TI->ptr_pipe;
                    status      = ptr_qTD->DW2.Status;
                    transferred = ptr_TI->num_to_transfer - ptr_qTD->DW2.TBT;
                    ptr_TI->num_transferred_total += transferred;

                    if (((status & (1UL << 7)) == 0U) &&
                            ((status & (1UL << 6)) == 0U))                    // No Error
                    {
                        if (ptr_TI->num == ptr_TI->num_transferred_total)   // All data was transferred
                        {
                            ep_event = ARM_USBH_EVENT_TRANSFER_COMPLETE;
                        }
                        else
                        {
                            if ((ptr_qTD->DW2.PID == 1U) &&                   // Receiving from IN endpoint
                                    (transferred != ptr_TI->num_to_transfer))     // Short packet or ZLP
                            {
                                ep_event = ARM_USBH_EVENT_TRANSFER_COMPLETE;
                            }
                        }

                        if (!ep_event)
                        {
                            // Restart transfer of remaining data
                            if ((ptr_TI->num - ptr_TI->num_transferred_total) >= 16384U)
                            {
                                ptr_TI->num_to_transfer = 16384U;
                            }
                            else
                            {
                                ptr_TI->num_to_transfer = (ptr_TI->num - ptr_TI->num_transferred_total);
                            }

                            (void)USBH_EHCI_qTD_Enqueue(ctrl, ptr_TI, (USBH_EHCI_qH *)((uint32_t)ptr_TI->ptr_pipe), (USBH_EHCI_qTD *)((uint32_t)ptr_TI->ptr_transfer), ptr_TI->packet, ptr_TI->data + ptr_TI->num_transferred_total,
                                                        ptr_TI->num_to_transfer);
                        }
                        else
                        {
                            // Transfer completed
#if 0
                            // LED indicator IND0 control
                            if (((USBH_EHCI_qH *)((uint32_t)ptr_TI->ptr_pipe))->DW2.ISM != 0U)
                            {
                                for (j = 0U; j < 15U; j++)
                                {
                                    if ((port_act[ctrl] & (1UL << j)) != 0U)
                                    {
                                        usbh_ehci_reg_ptr[ctrl]->PORTSC[j] ^=  USBH_EHCI_PORTSC_PIC(1);   // Change IND0 state
                                    }
                                }
                            }
                            else
                            {
                                for (j = 0U; j < 15U; j++)
                                {
                                    if ((port_act[ctrl] & (1UL << j)) != 0U)
                                    {
                                        usbh_ehci_reg_ptr[ctrl]->PORTSC[j] &= ~USBH_EHCI_PORTSC_PIC(1);   // Deactivate IND0
                                    }
                                }
                            }

#endif
                        }
                    }
                    else
                    {
                        if ((status & (1UL << 6)) != 0U)            // Halted
                        {
                            if ((status & (1UL << 4)) != 0U)   // Babble Detected
                            {
                                ep_event = ARM_USBH_EVENT_BUS_ERROR;
                            }
                            else if ((status & (1UL << 3)) != 0U)     // Transaction Error
                            {
                                ep_event = ARM_USBH_EVENT_BUS_ERROR;
                            }
                            else if ((status & (1UL << 5)) != 0U)     // Data Buffer Error
                            {
                                ep_event = ARM_USBH_EVENT_BUS_ERROR;
                            }
                            else
                            {
                                ep_event = ARM_USBH_EVENT_HANDSHAKE_STALL;
                            }
                        }
                    }

                    if (ep_event != 0U)
                    {
                        ptr_TI->active = 0U;
                        signal_pipe_event[ctrl](pipe_handle, ep_event);
                    }
                }

                ptr_qTD++;
            }
        }

#endif
    }
}
static void Driver_USBH0_IRQ_Handler(void)
{
    USBH_HW_IRQ_Handler(0U);
}
#if   (USBH_EHCI_TT_INSTANCES >= 2)
static void Driver_USBH1_IRQ_Handler(void)
{
    USBH_HW_IRQ_Handler(1U);
}
#endif

ARM_DRIVER_USBH USBHn_DRIVER(USBH0_EHCI_DRV_NUM) =
{
    USBH0_HW_GetVersion,
    USBH0_HW_GetCapabilities,
    USBH0_HW_Initialize,
    USBH0_HW_Uninitialize,
    USBH0_HW_PowerControl,
    USBH0_HW_PortVbusOnOff,
    USBH0_HW_PortReset,
    USBH0_HW_PortSuspend,
    USBH0_HW_PortResume,
    USBH0_HW_PortGetState,
    USBH0_HW_PipeCreate,
    USBH0_HW_PipeModify,
    USBH0_HW_PipeDelete,
    USBH0_HW_PipeReset,
    USBH0_HW_PipeTransfer,
    USBH0_HW_PipeTransferGetResult,
    USBH0_HW_PipeTransferAbort,
    USBH0_HW_GetFrameNumber
};

#if (USBH_EHCI_TT_INSTANCES >= 2)
ARM_DRIVER_USBH USBHn_DRIVER(USBH1_EHCI_DRV_NUM) =
{
    USBH1_HW_GetVersion,
    USBH1_HW_GetCapabilities,
    USBH1_HW_Initialize,
    USBH1_HW_Uninitialize,
    USBH1_HW_PowerControl,
    USBH1_HW_PortVbusOnOff,
    USBH1_HW_PortReset,
    USBH1_HW_PortSuspend,
    USBH1_HW_PortResume,
    USBH1_HW_PortGetState,
    USBH1_HW_PipeCreate,
    USBH1_HW_PipeModify,
    USBH1_HW_PipeDelete,
    USBH1_HW_PipeReset,
    USBH1_HW_PipeTransfer,
    USBH1_HW_PipeTransferGetResult,
    USBH1_HW_PipeTransferAbort,
    USBH1_HW_GetFrameNumber
};
#endif
